/* IBM_PROLOG_BEGIN_TAG                                                   */
/* This is an automatically generated prolog.                             */
/*                                                                        */
/* $Source: src/usr/hdat/hdatutil.H $                                     */
/*                                                                        */
/* OpenPOWER HostBoot Project                                             */
/*                                                                        */
/* Contributors Listed Below - COPYRIGHT 2015,2022                        */
/* [+] International Business Machines Corp.                              */
/*                                                                        */
/*                                                                        */
/* Licensed under the Apache License, Version 2.0 (the "License");        */
/* you may not use this file except in compliance with the License.       */
/* You may obtain a copy of the License at                                */
/*                                                                        */
/*     http://www.apache.org/licenses/LICENSE-2.0                         */
/*                                                                        */
/* Unless required by applicable law or agreed to in writing, software    */
/* distributed under the License is distributed on an "AS IS" BASIS,      */

#define DDIMM_SPD_BYTE_427                          427
#define DDIMM_SPD_BYTE_428                          428
#define DDIMM_SPD_BYTE_429                          429
#define DDIMM_SPD_BYTE_430                          430
#define DDIMM_SPD_BYTE_431                          431
#define DDIMM_SPD_BYTE_432                          432
#define DDIMM_SPD_BYTE_433                          433
#define DDIMM_SPD_BYTE_434                          434
#define DDIMM_SPD_BYTE_435                          435
#define DDIMM_SPD_BYTE_436                          436
#define DDIMM_SPD_BYTE_437                          437
// 438-441 specifies the CCIN
#define DDIMM_SPD_BYTE_438                          438
#define DDIMM_SPD_BYTE_439                          439
#define DDIMM_SPD_BYTE_440                          440
#define DDIMM_SPD_BYTE_441                          441

// Common defines
#define DDIMM_SPD_START_OFFSET                      0
#define DDIMM_SPD_SZ                                4096
#define DDIMM_SPD_EMP_OFFSET                        640
#define DDIMM_SPD_EMP_SZ                            384
#define DDIMM_SPD_EUP_OFFSET                        3072
#define DDIMM_SPD_EUP_SZ                            1024

// IBM specific defines
#define IBM_SPECIFIC_DDR4_NVDIMM                    0x91
#define IBM_SPECIFIC_11S_FORMAT                     "11S"
#define SPD_SIZE_3_BYTES                            3

#define DBG_MRK "D>"

//initialize the trac buffers
#define HDAT_ENTER()  \
        TRACFCOMP(g_trac_hdat,ENTER_MRK"[%s]",__FUNCTION__);

#define HDAT_EXIT()   \
    TRACFCOMP(g_trac_hdat,EXIT_MRK"[%s]",__FUNCTION__);

#define STRINGIFY(x) #x
#define TOSTRING(x) STRINGIFY(x)

#define AT " [ " __FILE__ " ]:[ " TOSTRING(__LINE__) " ]: "

#define HDAT_ERR( _fmt_, _args_...) \
        TRACFCOMP( g_trac_hdat,ERR_MRK AT _fmt_, ##_args_ );

#define HDAT_DBG( _fmt_, _args_...)  \
        TRACFCOMP( g_trac_hdat,DBG_MRK _fmt_, ##_args_ );

#define HDAT_INF( _fmt_, _args_...)  \
        TRACFCOMP( g_trac_hdat,DBG_MRK _fmt_, ##_args_ );

#define UINT64_HIGH(u) ((u & 0xFFFFFFFF00000000) >> 32)

#define UINT64_LOW(u) (u & 0x00000000FFFFFFFF)

#define HDAT_ADD_PAD(x) x += (16 - ((uint64_t)x % 16))

#define HDAT_NV_KWD_MAGIC_WRD  0x4E563030    // "NV00"
#define NUM_BRICKS_PER_OBUS 3

/**
 * Retrieve the CLASS of the target, or return NA if the target is NULL
 */
#define GETCLASS(pTarget) (((pTarget) == NULL) ? (TARGETING::CLASS_NA) : \
        ((pTarget)->getAttr<TARGETING::ATTR_CLASS>()))

/**
 *  * Retrieve the TYPE of the target, or return NA if the target is NULL
 *   */
#define GETTYPE(pTarget) (((pTarget) == NULL) ? (TARGETING::TYPE_NA) : \
        ((pTarget)->getAttr<TARGETING::ATTR_TYPE>()))


namespace HDAT
{

extern trace_desc_t* g_trac_hdat;

#define HDAT_8BYTE_ACCESS_SUPPORT 0x8000000000000000
#define HDAT_4BYTE_ACCESS_SUPPORT 0x4000000000000000

enum HOST_I2C_DEV_INFO_VERSION : uint32_t
{
    V2 = 0x00000002,
};

/** @brief Defines the Host I2C device info
 */
struct hdatI2cData_t
{
    uint8_t  hdatI2cEngine;
    uint8_t  hdatI2cMasterPort;
    uint16_t hdatI2cBusSpeed;
    uint8_t  hdatI2cSlaveDevType;
    uint8_t  hdatI2cSlaveDevAddr;
    uint8_t  hdatI2cSlavePort;
    uint8_t  hdatReserved1;
    uint32_t hdatI2cSlaveDevPurp;
    uint32_t hdatI2cLinkId;
    uint16_t hdatI2cSlcaIndex;
    char     hdatI2cLabel[64];

}__attribute__ ((packed));

/* @brief Defines the SMP Link info */
struct hdatSMPLinkInfo_t
{
    uint32_t hdatSMPLinkID;
    uint32_t hdatSMPLinkUsage;
    uint32_t hdatSMPLinkBrickID;
    uint32_t hdatSMPLinkLaneMask;
    uint16_t hdatSMPLinkPCISlotIndex;
    uint16_t hdatSMPLinkPCISlotSideBand;
    uint16_t hdatSMPLinkSLCAIndex;
    uint16_t hdatReserved1;
    uint32_t hdatSMPLinkI2cLinkId;
    uint32_t hdatSMPLinkI2cLinkIdPres;
    uint32_t hdatSMPLinkI2cLinkIdMicro;
    uint8_t  hdatSMPLinkSpeed;
    uint8_t  hdatSMPOccRegBitPos;
    uint16_t hdatSMPGPUSlcaIdx;

}__attribute__ ((packed));

enum hdatSMPLinkUsage
{
    HDAT_SMP_LINK_USAGE_SMP         = 0,
    HDAT_SMP_LINK_USAGE_NATIVE_GPU  = 1,
    HDAT_SMP_LINK_USAGE_EXT_IODRW   = 2,
    HDAT_SMP_LINK_USAGE_GPU_TO_GPU  = 3,
    HDAT_SMP_LINK_USAGE_UNKNOWN     = 0xFFFF,
};
enum hdatWitherspoonNVCnfg
{
    HDAT_REDBUD_NV_CNFG             = 1,
    HDAT_SEQUOIA_NV_CNFG            = 2,
};

/** @enum NV Link speeds
  */
enum hdatNVLinkSpeed
{
    HDAT_OBUS_FREQ_20GBPS       = 0,
    HDAT_OBUS_FREQ_25GBPS       = 1,
    HDAT_OBUS_FREQ_25_78125GBPS = 2,
};

/** @brief Structure definition for an entry in the chip's engineering change
 *         level array
 */
struct hdatEcLvl_t
{
    uint32_t hdatChipManfId;  // 0x0000 Chip manufacturing id
    uint32_t hdatChipEcLvl;   // 0x0004 Chip EC level
}  __attribute__ ((packed));

/** @brief Structure defination for an entry in Proc Chip ec level array */
struct hdatProcEcLvlElement_t
{
    hdatEcLvl_t hdatEcLvl;  
    uint64_t    hdatEcid[2]; // Proc ECID
} __attribute__ ((packed));

/** @brief Address range array element information of MMIO regions for OCMB
 *         access by HBRT
 */
struct hdatMsAreaMmioAddrRange_t
{
    hdatMsAddr_t hdatMmioAddrRngStrAddr;    // 0x0000 Range starting address
    hdatMsAddr_t hdatMmioAddrRngEndAddr;    // 0x0008 Range ending address
    uint32_t hdatMmioMemCtlId;              // 0x0010 Memory Controller ID
    uint32_t hdatMmioProcPhyChipId;         // 0x0014 Processor Physical Chip ID
    uint64_t hdatMmioHbrtChipId;            // 0x0018 HBRT Chip ID
    uint64_t hdatMmioFlags;                 // 0x0020 Flags
}  __attribute__ ((packed));

/** @brief Defines the Host SPI device info
 */
struct hdatSpiDevData_t
{
    uint32_t hdatSpiDevId;
    uint8_t  hdatSpiMasterEngine;
    uint8_t  hdatSpiMasterPort;
    uint16_t hdatReserved1;
    uint32_t hdatSpiBusSpeed;
    uint8_t  hdatSpiSlaveDevType;
    uint16_t hdatReserved2;
    uint8_t  hdatReserved3;
    uint32_t hdatSpiDevPurp;
    uint16_t hdatSpiSlcaIndex;
    char     hdatSpiDevStr[64];
}__attribute__ ((packed));

/** @brief Structure for uart interrupt info
*/
struct lockData_t
{
    hdatMsAddr_t hdatScomAddr;
    uint8_t  hdatBitPol;
    uint8_t  hdatIsSticky;
    uint8_t  hdatBitControl;
    uint8_t  hdatReserved1;
}__attribute__ ((packed));

/** @brief Defines the EEPROM partition info
 */
struct hdatEepromPartData_t
{
    uint32_t hdatSpiDevId;
    uint32_t hdatEepmPartDevPurp;
    uint32_t hdatEepmStartOffset;
    uint32_t hdatEepmSize;
    lockData_t hdatWriteLockInfo;
