/* IBM_PROLOG_BEGIN_TAG                                                   */
/* This is an automatically generated prolog.                             */
/*                                                                        */
/* $Source: src/usr/hdat/hdatmsvpd.H $                                    */
/*                                                                        */
/* OpenPOWER HostBoot Project                                             */
/*                                                                        */
/* Contributors Listed Below - COPYRIGHT 2016,2021                        */
/* [+] International Business Machines Corp.                              */
/*                                                                        */
/*                                                                        */
/* Licensed under the Apache License, Version 2.0 (the "License");        */
/* you may not use this file except in compliance with the License.       */
/* You may obtain a copy of the License at                                */
/*                                                                        */
/*     http://www.apache.org/licenses/LICENSE-2.0                         */
/*                                                                        */
/* Unless required by applicable law or agreed to in writing, software    */
/* distributed under the License is distributed on an "AS IS" BASIS,      */

/* IBM_PROLOG_END_TAG                                                     */
#ifndef HDATMSVPD_H
#define HDATMSVPD_H

/**
 *  @file hdatmsvpd.H
 *
 *  @brief This file contains the class definition for the main store
 *  VPD object.
 *
 */

/*----------------------------------------------------------------------------*/
/* Includes                                                                   */
/*----------------------------------------------------------------------------*/
#include <stdint.h>              // standard types
#include <hdat/hdat.H>                // HDAT header type definitions
#include "hdathdif.H"            // HdatHdif base class definition
#include "hdatmsarea.H"          // HdatMsArea class definition
#include <errl/errlentry.H>      // ErrlEntry class
#include "hdatutil.H"

namespace HDAT
{

/*----------------------------------------------------------------------------*/
/* Constants                                                                  */
/*----------------------------------------------------------------------------*/

/** @brief eye catcher for the HDIF header for the mainstore VPD data area
 */
const char HDAT_MSVPD_STRUCT_NAME[] = "MS VPD";
const uint32_t HDAT_NO_MEMORY = 0;
const uint32_t HDAT_MIN_NUM_FOR_SHARING = 2;
const uint32_t HDAT_BITS_PER_BYTE = 8;
const uint32_t HDAT_MB_PER_GB = 1024;
const uint32_t MAX_CHIP_EC_CNT_PER_MSAREA = 2;
const uint32_t HDAT_START_INSTANCE = 0;
const uint32_t HDAT_RHB_MAX_RANGE_ENTRIES = 100;
const uint32_t MAX_DIMMS_PER_MCBIST = 8;

//@TODO:RTC 213230(HDAT Axone additional support)
//Need to revisit the number if needed
//This number needs to be at least as large as the maximum number of OCMBs per
//NODE
const uint32_t HDAT_MAX_MSAREA_P10 = (1     // OCMB per OMI
                                      * 2   // OMI per MCC
                                      * 2   // MCC per MI
                                      * 1   // MI per MC
                                      * 4   // MC per PROC
                                      * 8); // PROC per NODE

/** @brief Structure version number
 */
const uint16_t HDAT_MS_VPD_VERSION = 0x24;

/** @enum hdatDataPtrs
 * Constants for the internal data pointers that are added to the base class
 */
enum hdatMsVpdDataPtrs
{
  HDAT_MS_VPD_MAX_ADDR     = 0,
  HDAT_MS_VPD_MAX_SIZE     = 1,
  HDAT_MS_VPD_PAGE_MOVER   = 2,
  HDAT_MS_VPD_IMT_ADDR_RNG = 3,
  HDAT_MS_VPD_UE_ADDR_RNG  = 4,
  HDAT_MS_VPD_HB_ADDR_RNG  = 5,
  HDAT_MS_VPD_LAST         = 6
};


/** @enum hdatChildPtrs
 *        Constants for the child structure pointers that are added to the base
 *        class
 */
enum hdatMsVpdChildPtrs
{
  HDAT_MS_AREAS        = 0,
  HDAT_MS_CHILD_RESERVED1 = 1,
  HDAT_MS_CHILD_LAST      = 2
};


/*----------------------------------------------------------------------------*/
/* Typedefs                                                                   */
/*----------------------------------------------------------------------------*/

/**
* @brief structure for RAM AREA Information
*
*/
struct hdatRamArea
{
    uint32_t ivHuid;
    bool ivFunctional;
    uint32_t ivSize;
    uint32_t ivfruId;
    hdatRamArea(uint32_t i_huid,
                bool status,
                uint32_t dimmSize,uint32_t i_fruId) :
                ivHuid(i_huid),
                ivFunctional(status),
                ivSize(dimmSize),
                ivfruId(i_fruId) {
                }
};

/** @brief Main store address information
 */
struct hdatMsVpdAddr_t
{
    hdatMsAddr_t hdatMaxAddr;    // 0x0000 Maximum configured mainstore address
    hdatMsAddr_t hdatMaxCcmAddr; // 0x0008 Maximum mainstore address that could
                                 // be configured if memory is added with
                                 // concurrent maintenance
    uint32_t  hdatMstSigAffntyDom; // 0x0010 The affinity domain considered
                                 //most important when making affinity decisions
    hdatMsAddr_t hdatMirrMemStartAddr;//0x0014 Mirrorable MemoryStarting Address
    hdatMsAddr_t hdatHRMORstashLoc;   //0x001C address to HRMOR stash location in HB reserved memory
}  __attribute__ ((packed));


/** @brief Main store size information
 */
struct hdatMsVpdSize_t
{
     uint32_t hdatReserved1; // 0x0000 reserved to make hdatTotSize 8 bytes
                             // in future
     uint32_t hdatTotSize;   // 0x0004 Total configured mainstore size in
                             // mega-bytes
}  __attribute__ ((packed));


/** @brief Page mover information
 */
struct hdatMsVpdPageMover_t
{
     uint32_t     hdatFlags;     // 0x0000 Flags
     uint32_t     hdatLockCnt;   // 0x0004 Count of hardware locks per page
     hdatMsAddr_t hdatLockAddr;  // 0x0008 Hardware lock address
     hdatMsAddr_t hdatMoverAddr; // 0x0010 Page mover address
     hdatMsAddr_t hdatBSRAddr;   // 0x0018 Barrier sync register address
     hdatMsAddr_t hdatXSCOMAddr; // 0x0020 address of XSCOM address range
}  __attribute__ ((packed));


/** @brief In Memory Trace address range array element information
 */
struct hdatMsVpdImtAddrRange_t
{
    hdatMsAddr_t hdatImtAddrRngStrAddr; // 0x0000 Range starting address
    hdatMsAddr_t hdatImtAddrRngEndAddr; // 0x0008 Range ending address+1
}  __attribute__ ((packed));


/** @brief In UE address range array element information - added for bi01
 */
struct hdatMsVpdUEAddrRange_t
{
    hdatMsAddr_t hdatUEAddr; // 0x0000 UE area starting address
}  __attribute__ ((packed));

/** @brief In Reserved Hostboot Memory iaddress range array element information
 */
struct hdatMsVpdRhbAddrRange_t
{
    uint32_t hdatRhbRngType:8;                    // 0x0000 Range type
    uint32_t hdatRhbRngId:24;                     // 0x0001 Range ID
    hdatMsAddr_t hdatRhbAddrRngStrAddr;           // 0x0004 Range starting
                                                  //        address
    hdatMsAddr_t hdatRhbAddrRngEndAddr;           // 0x000C Range ending
                                                  //        address+1
    uint32_t hdatRhbLabelSize;                    // 0x0014 Label size
    uint8_t hdatRhbLabelString[64];               // 0x0018 Label string Ptr
    hdatRhbPermType hdatRhbPermission;            // 0x0058 R/W Permissions
    uint8_t reserved[7];                          // 0x0059 Reserved
}  __attribute__ ((packed));

/** @brief Reserved HB length
 */
const uint16_t HDAT_MS_RHB_LABEL_LEN =
   sizeof(hdatMsVpdRhbAddrRange_t::hdatRhbLabelString);



struct hdatMsVpd_t
{
    hdatMsVpdAddr_t hdatMsAddr;
    hdatMsVpdSize_t hdatMsSize;
    hdatMsVpdPageMover_t hdatPageMover;
    hdatMsVpdImtAddrRange_t hdatImtAddrRange;
    hdatMsVpdUEAddrRange_t  hdatUEAddrRange;
    hdatMsVpdRhbAddrRange_t hdatRhbAddrRange;
}__attribute__ ((packed));

/*----------------------------------------------------------------------------*/
/* Constants                                                                  */
/*----------------------------------------------------------------------------*/

/* @enum hdatMsAreaStatus
 *       Status of an MS area.
 */
enum hdatMsAreaStatus
{
    HDAT_MEM_INSTALLED      = 0x8000,      // DIMMs are installed
    HDAT_MEM_FUNCTIONAL     = 0x4000,      // DIMMs are functional
