$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '12.2.0',
          'Headers' => {
                         'af-mctp.h' => 1,
                         'base.h' => 1,
                         'bios.h' => 1,
                         'bios_table.h' => 1,
                         'firmware_update.h' => 1,
                         'fru.h' => 1,
                         'instance-id.h' => 1,
                         'mctp-demux.h' => 1,
                         'pdr.h' => 1,
                         'platform.h' => 1,
                         'pldm.h' => 1,
                         'transport.h' => 1,
                         'utils.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libpldm.so.0.2.0',
          'LibraryVersion' => '0.2.0',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {},
          'SymbolInfo' => {
                            '100212' => {
                                          'Header' => 'pldm.h',
                                          'Return' => '98268',
                                          'ShortName' => 'pldm_open'
                                        },
                            '10030' => {
                                         'Header' => 'bios.h',

                                                 'pldm_pdr_find_record_by_type' => 1,
                                                 'pldm_pdr_fru_record_set_find_by_rsi' => 1,
                                                 'pldm_pdr_get_next_record' => 1,
                                                 'pldm_pdr_get_record_count' => 1,
                                                 'pldm_pdr_get_record_handle' => 1,
                                                 'pldm_pdr_get_repo_size' => 1,
                                                 'pldm_pdr_init' => 1,
                                                 'pldm_pdr_record_is_remote' => 1,
                                                 'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
                                                 'pldm_pdr_remove_remote_pdrs' => 1,
                                                 'pldm_pdr_update_TL_pdr' => 1,
                                                 'pldm_recv' => 1,
                                                 'pldm_recv_any' => 1,
                                                 'pldm_send' => 1,
                                                 'pldm_send_recv' => 1,
                                                 'pldm_transport_af_mctp_core' => 1,
                                                 'pldm_transport_af_mctp_destroy' => 1,
                                                 'pldm_transport_af_mctp_init' => 1,
                                                 'pldm_transport_af_mctp_init_pollfd' => 1,
                                                 'pldm_transport_af_mctp_map_tid' => 1,
                                                 'pldm_transport_af_mctp_unmap_tid' => 1,
                                                 'pldm_transport_mctp_demux_core' => 1,
                                                 'pldm_transport_mctp_demux_destroy' => 1,
                                                 'pldm_transport_mctp_demux_get_socket_fd' => 1,
                                                 'pldm_transport_mctp_demux_init' => 1,
                                                 'pldm_transport_mctp_demux_init_pollfd' => 1,
                                                 'pldm_transport_mctp_demux_init_with_fd' => 1,
                                                 'pldm_transport_mctp_demux_map_tid' => 1,
                                                 'pldm_transport_mctp_demux_unmap_tid' => 1,
                                                 'pldm_transport_poll' => 1,
                                                 'pldm_transport_recv_msg' => 1,
                                                 'pldm_transport_send_msg' => 1,
                                                 'pldm_transport_send_recv_msg' => 1,
                                                 'unpack_pldm_header' => 1,
                                                 'ver2str' => 1
                                               }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '100856' => {
                                        'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t, void**, size_t*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '98479'
                                                            },
                                                     '1' => {
                                                              'type' => '96144'
                                                            },
                                                     '2' => {
                                                              'type' => '16930'
                                                            },
                                                     '3' => {
                                                              'type' => '9082'
                                                            }
                                                   },
                                        'Return' => '98268',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '100897' => {
                                        'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t, void const*, size_t)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '98479'
                                                            },
                                                     '1' => {
                                                              'type' => '96144'
                                                            },
                                                     '2' => {
                                                              'type' => '1434'
                                                            },
                                                     '3' => {
                                                              'type' => '123'
                                                            }
                                                   },
                                        'Return' => '98268',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '100922' => {
                                        'BaseType' => '100927',
                                        'Name' => 'struct pollfd*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '100927' => {
                                        'Header' => undef,
                                        'Line' => '36',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'fd',
                                                             'offset' => '0',
                                                             'type' => '74'
                                                           },
                                                    '1' => {
                                                             'name' => 'events',
                                                             'offset' => '4',
                                                             'type' => '60'
                                                           },
                                                    '2' => {
                                                             'name' => 'revents',
                                                             'offset' => '6',
                                                             'type' => '60'
                                                           }
                                                  },
                                        'Name' => 'struct pollfd',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '100978' => {
                                        'Name' => 'int(*)(struct pldm_transport*, struct pollfd*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '98479'
                                                            },
                                                     '1' => {
                                                              'type' => '100922'
                                                            }
                                                   },
                                        'Return' => '74',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '101461' => {
                                        'Header' => undef,
                                        'Line' => '19',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'transport',
                                                             'offset' => '0',
                                                             'type' => '98484'
                                                           },
                                                    '1' => {
                                                             'name' => 'socket',
                                                             'offset' => '64',
                                                             'type' => '74'
                                                           },
                                                    '2' => {
                                                             'name' => 'tid_eid_map',
                                                             'offset' => '68',
                                                             'type' => '101515'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_transport_af_mctp',
                                        'PrivateABI' => 1,
                                        'Size' => '304',
                                        'Type' => 'Struct'
                                      },
                          '101515' => {
                                        'BaseType' => '96144',
                                        'Name' => 'pldm_tid_t[256]',
                                        'Size' => '256',
                                        'Type' => 'Array'
                                      },
                          '101825' => {
                                        'BaseType' => '101461',
                                        'Name' => 'struct pldm_transport_af_mctp*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '101986' => {
                                        'BaseType' => '101825',
                                        'Name' => 'struct pldm_transport_af_mctp**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '102' => {
                                     'Name' => 'unsigned long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '109' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '116' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '11611' => {
                                       'BaseType' => '116',
                                       'Name' => 'char*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11628' => {
                                       'BaseType' => '116',
                                       'Name' => 'char const',
                                       'Size' => '1',
                                       'Type' => 'Const'
                                     },
                          '11645' => {
                                       'BaseType' => '123',
                                       'Name' => 'size_t const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '11657' => {
                                       'BaseType' => '46',
                                       'Header' => undef,
                                       'Line' => '37',
                                       'Name' => '__int8_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '11731' => {
                                       'BaseType' => '109',
                                       'Header' => undef,
                                       'Line' => '194',
                                       'Name' => '__ssize_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11743' => {
                                       'BaseType' => '11657',
                                       'Header' => undef,
                                       'Line' => '24',
                                       'Name' => 'int8_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '11808' => {
                                       'BaseType' => '5051',
                                       'Name' => 'uint16_t const',
                                       'Size' => '2',
                                       'Type' => 'Const'
                                     },
                          '11825' => {
                                       'BaseType' => '180',
                                       'Name' => 'uint32_t const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '11996' => {
                                       'BaseType' => '168',
                                       'Header' => 'pldm_types.h',
                                       'Line' => '31',
                                       'Name' => 'bool8_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '12008' => {
                                       'BaseType' => '446',
                                       'Header' => 'pldm_types.h',
                                       'Line' => '163',
                                       'Name' => 'real32_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '123' => {
                                     'BaseType' => '102',
                                     'Header' => undef,
                                     'Line' => '214',
                                     'Name' => 'size_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '12549' => {
                                       'BaseType' => '11628',
                                       'Name' => 'char const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12554' => {
                                       'BaseType' => '11731',
                                       'Header' => undef,
                                       'Line' => '108',
                                       'Name' => 'ssize_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '13090' => {
                                       'Header' => 'platform.h',
                                       'Line' => '237',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_SENSOR_OP_STATE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_STATE_SENSOR_STATE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_NUMERIC_SENSOR_STATE',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum sensor_event_class_states',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '13124' => {
                                       'BaseType' => '13090',
                                       'Name' => 'enum sensor_event_class_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '13347' => {
                                       'Header' => 'platform.h',
                                       'Line' => '454',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '180'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '4',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '5',
                                                            'type' => '168'
                                                          },
                                                   '3' => {
                                                            'name' => 'record_change_num',
                                                            'offset' => '6',
                                                            'type' => '5051'
                                                          },
                                                   '4' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '5051'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_hdr',
                                       'Size' => '10',
                                       'Type' => 'Struct'
                                     },
                          '13426' => {
                                       'Header' => 'platform.h',
                                       'Line' => '526',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '13347'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '16',
                                                            'type' => '5051'
                                                          },
                                                   '2' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '18',
                                                            'type' => '5051'
                                                          },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '20',
                                                            'type' => '5051'
                                                          },
                                                   '4' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '22',
                                                            'type' => '5051'
                                                          },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '24',
                                                            'type' => '5051'
                                                          },
                                                   '6' => {
                                                            'name' => 'sensor_init',
                                                            'offset' => '32',
                                                            'type' => '168'
                                                          },
                                                   '7' => {
                                                            'name' => 'sensor_auxiliary_names_pdr',
                                                            'offset' => '33',
                                                            'type' => '11996'
                                                          },
                                                   '8' => {
                                                            'name' => 'composite_sensor_count',
                                                            'offset' => '34',
                                                            'type' => '168'
                                                          },
                                                   '9' => {
                                                            'name' => 'possible_states',
                                                            'offset' => '35',
                                                            'type' => '874'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_state_sensor_pdr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '13570' => {
                                       'Header' => 'platform.h',
                                       'Line' => '543',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state_set_id',
                                                            'offset' => '0',
                                                            'type' => '5051'
                                                          },
                                                   '1' => {
                                                            'name' => 'possible_states_size',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'states',
                                                            'offset' => '3',
                                                            'type' => '13628'
                                                          }
                                                 },
                                       'Name' => 'struct state_sensor_possible_states',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '13623' => {
                                       'BaseType' => '13570',
                                       'Name' => 'struct state_sensor_possible_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '13644' => {
                                       'Header' => 'platform.h',
                                       'Line' => '553',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '13347'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '16',
                                                            'type' => '5051'
                                                          },
                                                   '10' => {
                                                             'name' => 'possible_states',
                                                             'offset' => '37',
                                                             'type' => '874'
                                                           },
                                                   '2' => {
                                                            'name' => 'effecter_id',
                                                            'offset' => '18',
                                                            'type' => '5051'
                                                          },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '20',
                                                            'type' => '5051'
                                                          },
                                                   '4' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '22',
                                                            'type' => '5051'
                                                          },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '24',
                                                            'type' => '5051'
                                                          },
                                                   '6' => {
                                                            'name' => 'effecter_semantic_id',
                                                            'offset' => '32',
                                                            'type' => '5051'
                                                          },
                                                   '7' => {
                                                            'name' => 'effecter_init',
                                                            'offset' => '34',
                                                            'type' => '168'
                                                          },
                                                   '8' => {
                                                            'name' => 'has_description_pdr',
                                                            'offset' => '35',
                                                            'type' => '11996'
                                                          },
                                                   '9' => {
                                                            'name' => 'composite_effecter_count',
                                                            'offset' => '36',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_state_effecter_pdr',
                                       'Size' => '26',
                                       'Type' => 'Struct'
                                     },
                          '13997' => {
                                       'Header' => 'platform.h',
                                       'Line' => '708',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '180'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '4',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '5',
                                                            'type' => '168'
                                                          },
                                                   '3' => {
                                                            'name' => 'record_change_num',
                                                            'offset' => '6',
                                                            'type' => '5051'
                                                          },
                                                   '4' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '5051'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_value_pdr_hdr',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '14076' => {
                                       'Header' => 'platform.h',
                                       'Line' => '721',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '13997'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '18',
                                                            'type' => '5051'
                                                          },
                                                   '10' => {
                                                             'name' => 'rate_unit',
                                                             'offset' => '38',
                                                             'type' => '168'
                                                           },
                                                   '11' => {
                                                             'name' => 'base_oem_unit_handle',
                                                             'offset' => '39',
                                                             'type' => '168'
                                                           },
                                                   '12' => {
                                                             'name' => 'aux_unit',
                                                             'offset' => '40',
                                                             'type' => '168'
                                                           },
                                                   '13' => {
                                                             'name' => 'aux_unit_modifier',
                                                             'offset' => '41',
                                                             'type' => '11743'
                                                           },
                                                   '14' => {
                                                             'name' => 'aux_rate_unit',
                                                             'offset' => '48',
                                                             'type' => '168'
                                                           },
                                                   '15' => {
                                                             'name' => 'rel',
                                                             'offset' => '49',
                                                             'type' => '168'
                                                           },
                                                   '16' => {
                                                             'name' => 'aux_oem_unit_handle',
                                                             'offset' => '50',
                                                             'type' => '168'
                                                           },
                                                   '17' => {
                                                             'name' => 'is_linear',
                                                             'offset' => '51',
                                                             'type' => '11996'
                                                           },
                                                   '18' => {
                                                             'name' => 'sensor_data_size',
                                                             'offset' => '52',
                                                             'type' => '168'
                                                           },
                                                   '19' => {
                                                             'name' => 'resolution',
                                                             'offset' => '54',
                                                             'type' => '12008'
                                                           },
                                                   '2' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '20',
                                                            'type' => '5051'
                                                          },
                                                   '20' => {
                                                             'name' => 'offset',
                                                             'offset' => '64',
                                                             'type' => '12008'
                                                           },
                                                   '21' => {
                                                             'name' => 'accuracy',
                                                             'offset' => '68',
                                                             'type' => '5051'
                                                           },
                                                   '22' => {
                                                             'name' => 'plus_tolerance',
                                                             'offset' => '70',
                                                             'type' => '168'
                                                           },
                                                   '23' => {
                                                             'name' => 'minus_tolerance',
                                                             'offset' => '71',
                                                             'type' => '168'
                                                           },
                                                   '24' => {
                                                             'name' => 'hysteresis',
                                                             'offset' => '72',
                                                             'type' => '13985'
                                                           },
                                                   '25' => {
                                                             'name' => 'supported_thresholds',
                                                             'offset' => '82',
                                                             'type' => '11984'
                                                           },
                                                   '26' => {
                                                             'name' => 'threshold_and_hysteresis_volatility',
                                                             'offset' => '83',
                                                             'type' => '11984'
                                                           },
                                                   '27' => {
                                                             'name' => 'state_transition_interval',
                                                             'offset' => '86',
                                                             'type' => '12008'
                                                           },
                                                   '28' => {
                                                             'name' => 'update_interval',
                                                             'offset' => '96',
                                                             'type' => '12008'
                                                           },
                                                   '29' => {
                                                             'name' => 'max_readable',
                                                             'offset' => '100',
                                                             'type' => '13985'
                                                           },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '22',
                                                            'type' => '5051'
                                                          },
                                                   '30' => {
                                                             'name' => 'min_readable',
                                                             'offset' => '104',
                                                             'type' => '13985'
                                                           },
                                                   '31' => {
                                                             'name' => 'range_field_format',
                                                             'offset' => '114',
                                                             'type' => '168'
                                                           },
                                                   '32' => {
                                                             'name' => 'range_field_support',
                                                             'offset' => '115',
                                                             'type' => '11984'
                                                           },
                                                   '33' => {
                                                             'name' => 'nominal_value',
                                                             'offset' => '118',
                                                             'type' => '13893'
                                                           },
                                                   '34' => {
                                                             'name' => 'normal_max',
                                                             'offset' => '128',
                                                             'type' => '13893'
                                                           },
                                                   '35' => {
                                                             'name' => 'normal_min',
                                                             'offset' => '132',
                                                             'type' => '13893'
                                                           },
                                                   '36' => {
                                                             'name' => 'warning_high',
                                                             'offset' => '136',
                                                             'type' => '13893'
                                                           },
                                                   '37' => {
                                                             'name' => 'warning_low',
                                                             'offset' => '146',
                                                             'type' => '13893'
                                                           },
                                                   '38' => {
                                                             'name' => 'critical_high',
                                                             'offset' => '150',
                                                             'type' => '13893'
                                                           },
                                                   '39' => {
                                                             'name' => 'critical_low',
                                                             'offset' => '256',
                                                             'type' => '13893'
                                                           },
                                                   '4' => {
                                                            'name' => 'entity_instance_num',
                                                            'offset' => '24',
                                                            'type' => '5051'
                                                          },
                                                   '40' => {
                                                             'name' => 'fatal_high',
                                                             'offset' => '260',
                                                             'type' => '13893'
                                                           },
                                                   '41' => {
                                                             'name' => 'fatal_low',
                                                             'offset' => '264',
                                                             'type' => '13893'
                                                           },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '32',
                                                            'type' => '5051'
                                                          },
                                                   '6' => {
                                                            'name' => 'sensor_init',
                                                            'offset' => '34',
                                                            'type' => '168'
                                                          },
                                                   '7' => {
                                                            'name' => 'sensor_auxiliary_names_pdr',
                                                            'offset' => '35',
                                                            'type' => '11996'
                                                          },
                                                   '8' => {
                                                            'name' => 'base_unit',
                                                            'offset' => '36',
                                                            'type' => '168'
                                                          },
                                                   '9' => {
                                                            'name' => 'unit_modifier',
                                                            'offset' => '37',
                                                            'type' => '11743'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_numeric_sensor_value_pdr',
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '142' => {
                                     'BaseType' => '53',
                                     'Header' => undef,
                                     'Line' => '38',
                                     'Name' => '__uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '1434' => {
                                      'BaseType' => '1439',
                                      'Name' => 'void const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1439' => {
                                      'BaseType' => '1',
                                      'Name' => 'void const',
                                      'Type' => 'Const'
                                    },
                          '14636' => {
                                       'Header' => 'platform.h',
                                       'Line' => '770',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state_set_id',
                                                            'offset' => '0',
                                                            'type' => '5051'
                                                          },
                                                   '1' => {
                                                            'name' => 'possible_states_size',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'states',
                                                            'offset' => '3',
                                                            'type' => '13628'
                                                          }
                                                 },
                                       'Name' => 'struct state_effecter_possible_states',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '14689' => {
                                       'BaseType' => '14636',
                                       'Name' => 'struct state_effecter_possible_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '14694' => {
                                       'Header' => 'platform.h',
                                       'Line' => '818',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'set_request',
                                                            'offset' => '0',
                                                            'type' => '168'
                                                          },
                                                   '1' => {
                                                            'name' => 'effecter_state',
                                                            'offset' => '1',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct state_field_for_state_effecter_set',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '14734' => {
                                       'BaseType' => '14694',
                                       'Header' => 'platform.h',
                                       'Line' => '821',
                                       'Name' => 'set_effecter_state_field',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '14746' => {
                                       'Header' => 'platform.h',
                                       'Line' => '827',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sensor_op_state',
                                                            'offset' => '0',
                                                            'type' => '168'
                                                          },
                                                   '1' => {
                                                            'name' => 'present_state',
                                                            'offset' => '1',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'previous_state',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '3' => {
                                                            'name' => 'event_state',
                                                            'offset' => '3',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct state_field_for_get_state_sensor_readings',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '14812' => {
                                       'BaseType' => '14746',
                                       'Header' => 'platform.h',
                                       'Line' => '835',
                                       'Name' => 'get_sensor_state_field',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '15011' => {
                                       'BaseType' => '168',
                                       'Name' => 'uint8_t[13]',
                                       'Size' => '13',
                                       'Type' => 'Array'
                                     },
                          '154' => {
                                     'BaseType' => '81',
                                     'Header' => undef,
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '15493' => {
                                       'Header' => 'platform.h',
                                       'Line' => '972',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '0',
                                                            'type' => '5051'
                                                          },
                                                   '1' => {
                                                            'name' => 'sensor_event_class_type',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'event_class',
                                                            'offset' => '3',
                                                            'type' => '874'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_sensor_event_data',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '15705' => {
                                       'Header' => 'platform.h',
                                       'Line' => '1053',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'event_data_format',
                                                            'offset' => '0',
                                                            'type' => '168'
                                                          },
                                                   '1' => {
                                                            'name' => 'number_of_change_records',
                                                            'offset' => '1',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'change_records',
                                                            'offset' => '2',
                                                            'type' => '874'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_repository_chg_event_data',
                                       'Size' => '3',
                                       'Type' => 'Struct'
                                     },
                          '1632' => {
                                      'BaseType' => '830',
                                      'Name' => 'struct pldm_msg*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '166' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '168' => {
                                     'BaseType' => '142',
                                     'Header' => undef,
                                     'Line' => '24',
                                     'Name' => 'uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '16930' => {
                                       'BaseType' => '166',
                                       'Name' => 'void**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '180' => {
                                     'BaseType' => '154',
                                     'Header' => undef,
                                     'Line' => '26',
                                     'Name' => 'uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '2077' => {
                                      'BaseType' => '869',
                                      'Name' => 'struct pldm_msg const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2082' => {
                                      'BaseType' => '168',
                                      'Name' => 'uint8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2087' => {
                                      'BaseType' => '180',
                                      'Name' => 'uint32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '21092' => {
                                       'BaseType' => '9082',
                                       'Name' => 'size_t*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '22705' => {
                                       'BaseType' => '22715',
                                       'Name' => 'uint32_t const*const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '22710' => {
                                       'BaseType' => '11825',
                                       'Name' => 'uint32_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '22715' => {
                                       'BaseType' => '22710',
                                       'Name' => 'uint32_t const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '22720' => {
                                       'BaseType' => '15705',
                                       'Name' => 'struct pldm_pdr_repository_chg_event_data*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2903' => {
                                      'BaseType' => '429',
                                      'Name' => 'ver32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '29130' => {
                                       'BaseType' => '14076',
                                       'Name' => 'struct pldm_numeric_sensor_value_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '3344' => {
                                      'BaseType' => '441',
                                      'Name' => 'ver32_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '35697' => {
                                       'BaseType' => '15493',
                                       'Name' => 'struct pldm_sensor_event_data*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '35702' => {
                                       'BaseType' => '35697',
                                       'Name' => 'struct pldm_sensor_event_data*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '363' => {
                                     'Header' => 'pldm_types.h',
                                     'Line' => '24',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'alpha',
                                                          'offset' => '0',
                                                          'type' => '168'
                                                        },
                                                 '1' => {
                                                          'name' => 'update',
                                                          'offset' => '1',
                                                          'type' => '168'
                                                        },
                                                 '2' => {
                                                          'name' => 'minor',
                                                          'offset' => '2',
                                                          'type' => '168'
                                                        },
                                                 '3' => {
                                                          'name' => 'major',
                                                          'offset' => '3',
                                                          'type' => '168'
                                                        }
                                               },
                                     'Name' => 'struct pldm_version',
                                     'Size' => '4',
                                     'Type' => 'Struct'
                                   },
                          '36706' => {
                                       'BaseType' => '14812',
                                       'Name' => 'get_sensor_state_field*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41857' => {
                                       'BaseType' => '14734',
                                       'Name' => 'set_effecter_state_field*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '42686' => {
                                       'BaseType' => '13426',
                                       'Name' => 'struct pldm_state_sensor_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '42691' => {
                                       'BaseType' => '42686',
                                       'Name' => 'struct pldm_state_sensor_pdr*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '42696' => {
                                       'BaseType' => '13623',
                                       'Name' => 'struct state_sensor_possible_states const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '42701' => {
                                       'BaseType' => '42696',
                                       'Name' => 'struct state_sensor_possible_states const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '429' => {
                                     'BaseType' => '363',
                                     'Header' => 'pldm_types.h',
                                     'Line' => '29',
                                     'Name' => 'ver32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '43018' => {
                                       'BaseType' => '13644',
                                       'Name' => 'struct pldm_state_effecter_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '43023' => {
                                       'BaseType' => '43018',
                                       'Name' => 'struct pldm_state_effecter_pdr*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '43028' => {
                                       'BaseType' => '14689',
                                       'Name' => 'struct state_effecter_possible_states const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '43033' => {
                                       'BaseType' => '43028',
                                       'Name' => 'struct state_effecter_possible_states const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '441' => {
                                     'BaseType' => '429',
                                     'Name' => 'ver32_t const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '446' => {
                                     'Name' => 'float',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '46' => {
                                    'Name' => 'signed char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '46548' => {
                                       'BaseType' => '102',
                                       'Header' => undef,
                                       'Line' => '45',
                                       'Name' => '__uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '46625' => {
                                       'BaseType' => '46548',
                                       'Header' => undef,
                                       'Line' => '27',
                                       'Name' => 'uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '46637' => {
                                       'Header' => 'bios.h',
                                       'Line' => '38',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_BIOS_STRING_TABLE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_BIOS_ATTR_TABLE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum pldm_bios_table_types',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '46671' => {
                                       'Header' => 'bios.h',
                                       'Line' => '47',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'string_handle',
                                                            'offset' => '0',
                                                            'type' => '5051'
                                                          },
                                                   '1' => {
                                                            'name' => 'string_length',
                                                            'offset' => '2',
                                                            'type' => '5051'
                                                          },
                                                   '2' => {
                                                            'name' => 'name',
                                                            'offset' => '4',
                                                            'type' => '46728'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_string_table_entry',
                                       'Size' => '5',
                                       'Type' => 'Struct'
                                     },
                          '46723' => {
                                       'BaseType' => '46671',
                                       'Name' => 'struct pldm_bios_string_table_entry const',
                                       'Size' => '5',
                                       'Type' => 'Const'
                                     },
                          '46728' => {
                                       'BaseType' => '116',
                                       'Name' => 'char[1]',
                                       'Size' => '1',
                                       'Type' => 'Array'
                                     },
                          '46744' => {
                                       'Header' => 'bios.h',
                                       'Line' => '53',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_handle',
                                                            'offset' => '0',
                                                            'type' => '5051'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_type',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'string_handle',
                                                            'offset' => '3',
                                                            'type' => '5051'
                                                          },
                                                   '3' => {
                                                            'name' => 'metadata',
                                                            'offset' => '5',
                                                            'type' => '874'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_attr_table_entry',
                                       'Size' => '6',
                                       'Type' => 'Struct'
                                     },
                          '46809' => {
                                       'BaseType' => '46744',
                                       'Name' => 'struct pldm_bios_attr_table_entry const',
                                       'Size' => '6',
                                       'Type' => 'Const'
                                     },
                          '46830' => {
                                       'Header' => 'bios.h',
                                       'Line' => '65',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_handle',
                                                            'offset' => '0',
                                                            'type' => '5051'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_type',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'value',
                                                            'offset' => '3',
                                                            'type' => '874'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_attr_val_table_entry',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '46882' => {
                                       'BaseType' => '46830',
                                       'Name' => 'struct pldm_bios_attr_val_table_entry const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '46951' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '215',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5051'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '6421'
                                                          },
                                                   '2' => {
                                                            'name' => 'pv_num',
                                                            'offset' => '3',
                                                            'type' => '168'
                                                          },
                                                   '3' => {
                                                            'name' => 'pv_handle',
                                                            'offset' => '8',
                                                            'type' => '47054'
                                                          },
                                                   '4' => {
                                                            'name' => 'def_num',
                                                            'offset' => '22',
                                                            'type' => '168'
                                                          },
                                                   '5' => {
                                                            'name' => 'def_index',
                                                            'offset' => '36',
                                                            'type' => '6243'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '47042' => {
                                       'BaseType' => '46951',
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '4705' => {
                                      'BaseType' => '825',
                                      'Name' => 'struct pldm_msg_hdr const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '47054' => {
                                       'BaseType' => '11808',
                                       'Name' => 'uint16_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '47064' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '328',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5051'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '6421'
                                                          },
                                                   '2' => {
                                                            'name' => 'string_type',
                                                            'offset' => '3',
                                                            'type' => '168'
                                                          },
                                                   '3' => {
                                                            'name' => 'min_length',
                                                            'offset' => '4',
                                                            'type' => '5051'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_length',
                                                            'offset' => '6',
                                                            'type' => '5051'
                                                          },
                                                   '5' => {
                                                            'name' => 'def_length',
                                                            'offset' => '8',
                                                            'type' => '5051'
                                                          },
                                                   '6' => {
                                                            'name' => 'def_string',
                                                            'offset' => '22',
                                                            'type' => '12549'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '4710' => {
                                      'BaseType' => '890',
                                      'Name' => 'struct pldm_header_info*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '47176' => {
                                       'BaseType' => '47064',
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '47186' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '431',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5051'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '6421'
                                                          },
                                                   '2' => {
                                                            'name' => 'lower_bound',
                                                            'offset' => '8',
                                                            'type' => '46625'
                                                          },
                                                   '3' => {
                                                            'name' => 'upper_bound',
                                                            'offset' => '22',
                                                            'type' => '46625'
                                                          },
                                                   '4' => {
                                                            'name' => 'scalar_increment',
                                                            'offset' => '36',
                                                            'type' => '180'
                                                          },
                                                   '5' => {
                                                            'name' => 'default_value',
                                                            'offset' => '50',
                                                            'type' => '46625'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '47284' => {
                                       'BaseType' => '47186',
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
                                       'Size' => '40',
                                       'Type' => 'Const'
                                     },
                          '47628' => {
                                       'Name' => 'size_t(*)(void const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '1434'
                                                           }
                                                  },
                                       'Return' => '123',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '47696' => {
                                       'Header' => undef,
                                       'Line' => '907',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'table_data',
                                                            'offset' => '0',
                                                            'type' => '6243'
                                                          },
                                                   '1' => {
                                                            'name' => 'table_len',
                                                            'offset' => '8',
                                                            'type' => '123'
                                                          },
                                                   '2' => {
                                                            'name' => 'current_pos',
                                                            'offset' => '22',
                                                            'type' => '123'
                                                          },
                                                   '3' => {
                                                            'name' => 'entry_length_handler',
                                                            'offset' => '36',
                                                            'type' => '47628'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_iter',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '47766' => {
                                       'BaseType' => '47696',
                                       'Name' => 'struct pldm_bios_table_iter const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '4800' => {
                                      'BaseType' => '969',
                                      'Name' => 'struct pldm_header_info const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4805' => {
                                      'BaseType' => '714',
                                      'Name' => 'struct pldm_msg_hdr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '48798' => {
                                       'BaseType' => '47696',
                                       'Name' => 'struct pldm_bios_table_iter*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '48803' => {
                                       'BaseType' => '46882',
                                       'Name' => 'struct pldm_bios_attr_val_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '49218' => {
                                       'BaseType' => '46809',
                                       'Name' => 'struct pldm_bios_attr_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '49824' => {
                                       'BaseType' => '46723',
                                       'Name' => 'struct pldm_bios_string_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '5001' => {
                                      'BaseType' => '67',
                                      'Header' => undef,
                                      'Line' => '40',
                                      'Name' => '__uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '5046' => {
                                      'BaseType' => '168',
                                      'Name' => 'uint8_t const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '5051' => {
                                      'BaseType' => '5001',
                                      'Header' => undef,
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '50945' => {
                                       'BaseType' => '47766',
                                       'Name' => 'struct pldm_bios_table_iter const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '53' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '55729' => {
                                       'BaseType' => '46625',
                                       'Name' => 'uint64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '55933' => {
                                       'BaseType' => '47284',
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '56237' => {
                                       'BaseType' => '12549',
                                       'Name' => 'char const**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '57464' => {
                                       'BaseType' => '47176',
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '59363' => {
                                       'BaseType' => '47042',
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '60' => {
                                    'Name' => 'short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '6204' => {
                                      'Header' => 'utils.h',
                                      'Line' => '18',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ptr',
                                                           'offset' => '0',
                                                           'type' => '6243'
                                                         },
                                                  '1' => {
                                                           'name' => 'length',
                                                           'offset' => '8',
                                                           'type' => '123'
                                                         }
                                                },
                                      'Name' => 'struct variable_field',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '6243' => {
                                      'BaseType' => '5046',
                                      'Name' => 'uint8_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6421' => {
                                      'Name' => '_Bool',
                                      'Size' => '1',
                                      'Type' => 'Intrinsic'
                                    },
                          '65216' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '329',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'uuid',
                                                            'offset' => '0',
                                                            'type' => '65320'
                                                          },
                                                   '1' => {
                                                            'name' => 'package_header_format_version',
                                                            'offset' => '22',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'package_header_size',
                                                            'offset' => '23',
                                                            'type' => '5051'
                                                          },
                                                   '3' => {
                                                            'name' => 'package_release_date_time',
                                                            'offset' => '25',
                                                            'type' => '15011'
                                                          },
                                                   '4' => {
                                                            'name' => 'component_bitmap_bit_length',
                                                            'offset' => '50',
                                                            'type' => '5051'
                                                          },
                                                   '5' => {
                                                            'name' => 'package_version_string_type',
                                                            'offset' => '52',
                                                            'type' => '168'
                                                          },
                                                   '6' => {
                                                            'name' => 'package_version_string_length',
                                                            'offset' => '53',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_header_information',
                                       'Size' => '36',
                                       'Type' => 'Struct'
                                     },
                          '65320' => {
                                       'BaseType' => '168',
                                       'Name' => 'uint8_t[16]',
                                       'Size' => '16',
                                       'Type' => 'Array'
                                     },
                          '65352' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '343',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_length',
                                                            'offset' => '0',
                                                            'type' => '5051'
                                                          },
                                                   '1' => {
                                                            'name' => 'descriptor_count',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'device_update_option_flags',
                                                            'offset' => '3',
                                                            'type' => '62719'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_image_set_version_string_type',
                                                            'offset' => '7',
                                                            'type' => '168'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_image_set_version_string_length',
                                                            'offset' => '8',
                                                            'type' => '168'
                                                          },
                                                   '5' => {
                                                            'name' => 'fw_device_pkg_data_length',
                                                            'offset' => '9',
                                                            'type' => '5051'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_firmware_device_id_record',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '65547' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '377',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '5051'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '5051'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_comparison_stamp',
                                                            'offset' => '4',
                                                            'type' => '180'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_options',
                                                            'offset' => '8',
                                                            'type' => '62221'
                                                          },
                                                   '4' => {
                                                            'name' => 'requested_comp_activation_method',
                                                            'offset' => '16',
                                                            'type' => '62221'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_location_offset',
                                                            'offset' => '18',
                                                            'type' => '180'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_size',
                                                            'offset' => '22',
                                                            'type' => '180'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_version_string_type',
                                                            'offset' => '32',
                                                            'type' => '168'
                                                          },
                                                   '8' => {
                                                            'name' => 'comp_version_string_length',
                                                            'offset' => '33',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_component_image_information',
                                       'Size' => '22',
                                       'Type' => 'Struct'
                                     },
                          '65729' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '403',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '168'
                                                          },
                                                   '1' => {
                                                            'name' => 'capabilities_during_update',
                                                            'offset' => '1',
                                                            'type' => '62719'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_count',
                                                            'offset' => '5',
                                                            'type' => '5051'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_image_set_ver_str_type',
                                                            'offset' => '7',
                                                            'type' => '168'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_image_set_ver_str_len',
                                                            'offset' => '8',
                                                            'type' => '168'
                                                          },
                                                   '5' => {
                                                            'name' => 'pending_comp_image_set_ver_str_type',
                                                            'offset' => '9',
                                                            'type' => '168'
                                                          },
                                                   '6' => {
                                                            'name' => 'pending_comp_image_set_ver_str_len',
                                                            'offset' => '16',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_get_firmware_parameters_resp',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '65833' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '417',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '5051'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '5051'
                                                          },
                                                   '10' => {
                                                             'name' => 'pending_comp_release_date',
                                                             'offset' => '37',
                                                             'type' => '66015'
                                                           },
                                                   '11' => {
                                                             'name' => 'comp_activation_methods',
                                                             'offset' => '51',
                                                             'type' => '62221'
                                                           },
                                                   '12' => {
                                                             'name' => 'capabilities_during_update',
                                                             'offset' => '53',
                                                             'type' => '62719'
                                                           },
                                                   '2' => {
                                                            'name' => 'comp_classification_index',
                                                            'offset' => '4',
                                                            'type' => '168'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_comparison_stamp',
                                                            'offset' => '5',
                                                            'type' => '180'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_ver_str_type',
                                                            'offset' => '9',
                                                            'type' => '168'
                                                          },
                                                   '5' => {
                                                            'name' => 'active_comp_ver_str_len',
                                                            'offset' => '16',
                                                            'type' => '168'
                                                          },
                                                   '6' => {
                                                            'name' => 'active_comp_release_date',
                                                            'offset' => '17',
                                                            'type' => '66015'
                                                          },
                                                   '7' => {
                                                            'name' => 'pending_comp_comparison_stamp',
                                                            'offset' => '25',
                                                            'type' => '180'
                                                          },
                                                   '8' => {
                                                            'name' => 'pending_comp_ver_str_type',
                                                            'offset' => '35',
                                                            'type' => '168'
                                                          },
                                                   '9' => {
                                                            'name' => 'pending_comp_ver_str_len',
                                                            'offset' => '36',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_component_parameter_entry',
                                       'Size' => '39',
                                       'Type' => 'Struct'
                                     },
                          '66015' => {
                                       'BaseType' => '168',
                                       'Name' => 'uint8_t[8]',
                                       'Size' => '8',
                                       'Type' => 'Array'
                                     },
                          '6643' => {
                                      'BaseType' => '6204',
                                      'Name' => 'struct variable_field*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '66875' => {
                                       'BaseType' => '6204',
                                       'Name' => 'struct variable_field const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '67' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '67223' => {
                                       'BaseType' => '11996',
                                       'Name' => 'bool8_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '70303' => {
                                       'BaseType' => '66875',
                                       'Name' => 'struct variable_field const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '714' => {
                                     'Header' => 'base.h',
                                     'Line' => '117',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'command',
                                                          'offset' => '2',
                                                          'type' => '168'
                                                        }
                                               },
                                     'Name' => 'struct pldm_msg_hdr',
                                     'Size' => '3',
                                     'Type' => 'Struct'
                                   },
                          '71605' => {
                                       'BaseType' => '65833',
                                       'Name' => 'struct pldm_component_parameter_entry*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '71835' => {
                                       'BaseType' => '65729',
                                       'Name' => 'struct pldm_get_firmware_parameters_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '72136' => {
                                       'BaseType' => '2082',
                                       'Name' => 'uint8_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '72433' => {
                                       'BaseType' => '65547',
                                       'Name' => 'struct pldm_component_image_information*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '73049' => {
                                       'BaseType' => '65352',
                                       'Name' => 'struct pldm_firmware_device_id_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '73201' => {
                                       'BaseType' => '65216',
                                       'Name' => 'struct pldm_package_header_information*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '74' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '79657' => {
                                       'BaseType' => '79674',
                                       'Header' => undef,
                                       'Line' => '15',
                                       'Name' => 'pldm_pdr',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '79669' => {
                                       'BaseType' => '79657',
                                       'Name' => 'pldm_pdr const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '79674' => {
                                       'Header' => undef,
                                       'Line' => '17',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_count',
                                                            'offset' => '0',
                                                            'type' => '180'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '4',
                                                            'type' => '180'
                                                          },
                                                   '2' => {
                                                            'name' => 'first',
                                                            'offset' => '8',
                                                            'type' => '80727'
                                                          },
                                                   '3' => {
                                                            'name' => 'last',
                                                            'offset' => '22',
                                                            'type' => '80727'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '79739' => {
                                       'BaseType' => '79756',
                                       'Header' => undef,
                                       'Line' => '20',
                                       'Name' => 'pldm_pdr_record',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '79751' => {
                                       'BaseType' => '79739',
                                       'Name' => 'pldm_pdr_record const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '79756' => {
                                       'Header' => undef,
                                       'Line' => '8',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '180'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '4',
                                                            'type' => '180'
                                                          },
                                                   '2' => {
                                                            'name' => 'data',
                                                            'offset' => '8',
                                                            'type' => '2082'
                                                          },
                                                   '3' => {
                                                            'name' => 'next',
                                                            'offset' => '22',
                                                            'type' => '80715'
                                                          },
                                                   '4' => {
                                                            'name' => 'is_remote',
                                                            'offset' => '36',
                                                            'type' => '6421'
                                                          },
                                                   '5' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '38',
                                                            'type' => '5051'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_record',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '79847' => {
                                       'Header' => 'pdr.h',
                                       'Line' => '217',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '0',
                                                            'type' => '5051'
                                                          },
                                                   '1' => {
                                                            'name' => 'entity_instance_num',
                                                            'offset' => '2',
                                                            'type' => '5051'
                                                          },
                                                   '2' => {
                                                            'name' => 'entity_container_id',
                                                            'offset' => '4',
                                                            'type' => '5051'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity',
                                       'Size' => '6',
                                       'Type' => 'Struct'
                                     },
                          '79899' => {
                                       'BaseType' => '79847',
                                       'Header' => 'pdr.h',
                                       'Line' => '221',
                                       'Name' => 'pldm_entity',
                                       'Size' => '6',
                                       'Type' => 'Typedef'
                                     },
                          '79939' => {
                                       'BaseType' => '79951',
                                       'Header' => undef,
                                       'Line' => '231',
                                       'Name' => 'pldm_entity_association_tree',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '79951' => {
                                       'Header' => undef,
                                       'Line' => '354',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'root',
                                                            'offset' => '0',
                                                            'type' => '80732'
                                                          },
                                                   '1' => {
                                                            'name' => 'last_used_container_id',
                                                            'offset' => '8',
                                                            'type' => '5051'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity_association_tree',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '79994' => {
                                       'BaseType' => '80006',
                                       'Header' => undef,
                                       'Line' => '236',
                                       'Name' => 'pldm_entity_node',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '80006' => {
                                       'Header' => undef,
                                       'Line' => '359',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity',
                                                            'offset' => '0',
                                                            'type' => '79899'
                                                          },
                                                   '1' => {
                                                            'name' => 'parent',
                                                            'offset' => '6',
                                                            'type' => '79899'
                                                          },
                                                   '2' => {
                                                            'name' => 'first_child',
                                                            'offset' => '22',
                                                            'type' => '80732'
                                                          },
                                                   '3' => {
                                                            'name' => 'next_sibling',
                                                            'offset' => '36',
                                                            'type' => '80732'
                                                          },
                                                   '4' => {
                                                            'name' => 'association_type',
                                                            'offset' => '50',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity_node',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '80715' => {
                                       'BaseType' => '79756',
                                       'Name' => 'struct pldm_pdr_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80727' => {
                                       'BaseType' => '79739',
                                       'Name' => 'pldm_pdr_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80732' => {
                                       'BaseType' => '79994',
                                       'Name' => 'pldm_entity_node*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '81' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '81494' => {
                                       'BaseType' => '81499',
                                       'Name' => 'pldm_entity**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '81499' => {
                                       'BaseType' => '79899',
                                       'Name' => 'pldm_entity*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '81584' => {
                                       'BaseType' => '79939',
                                       'Name' => 'pldm_entity_association_tree*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '81963' => {
                                       'BaseType' => '80732',
                                       'Name' => 'pldm_entity_node**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '825' => {
                                     'BaseType' => '714',
                                     'Name' => 'struct pldm_msg_hdr const',
                                     'Size' => '3',
                                     'Type' => 'Const'
                                   },
                          '82680' => {
                                       'BaseType' => '79657',
                                       'Name' => 'pldm_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '830' => {
                                     'Header' => 'base.h',
                                     'Line' => '150',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'hdr',
                                                          'offset' => '0',
                                                          'type' => '714'
                                                        },
                                                 '1' => {
                                                          'name' => 'payload',
                                                          'offset' => '3',
                                                          'type' => '874'
                                                        }
                                               },
                                     'Name' => 'struct pldm_msg',
                                     'Size' => '4',
                                     'Type' => 'Struct'
                                   },
                          '8519' => {
                                      'BaseType' => '5051',
                                      'Name' => 'uint16_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '869' => {
                                     'BaseType' => '830',
                                     'Name' => 'struct pldm_msg const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '874' => {
                                     'BaseType' => '168',
                                     'Name' => 'uint8_t[1]',
                                     'Size' => '1',
                                     'Type' => 'Array'
                                   },
                          '890' => {
                                     'Header' => 'base.h',
                                     'Line' => '160',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'msg_type',
                                                          'offset' => '0',
                                                          'type' => '702'
                                                        },
                                                 '1' => {
                                                          'name' => 'instance',
                                                          'offset' => '4',
                                                          'type' => '168'
                                                        },
                                                 '2' => {
                                                          'name' => 'pldm_type',
                                                          'offset' => '5',
                                                          'type' => '168'
                                                        },
                                                 '3' => {
                                                          'name' => 'command',
                                                          'offset' => '6',
                                                          'type' => '168'
                                                        },
                                                 '4' => {
                                                          'name' => 'completion_code',
                                                          'offset' => '7',
                                                          'type' => '168'
                                                        }
                                               },
                                     'Name' => 'struct pldm_header_info',
                                     'Size' => '8',
                                     'Type' => 'Struct'
                                   },
                          '89088' => {
                                       'BaseType' => '79669',
                                       'Name' => 'pldm_pdr const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '89093' => {
                                       'BaseType' => '79751',
                                       'Name' => 'pldm_pdr_record const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '9082' => {
                                      'BaseType' => '123',
                                      'Name' => 'size_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '96144' => {
                                       'BaseType' => '168',
                                       'Header' => 'base.h',
                                       'Line' => '14',
                                       'Name' => 'pldm_tid_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '96156' => {
                                       'BaseType' => '168',
                                       'Header' => 'instance-id.h',
                                       'Line' => '11',
                                       'Name' => 'pldm_instance_id_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '96536' => {
                                       'Header' => undef,
                                       'Line' => '18',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'prev',
                                                            'offset' => '0',
                                                            'type' => '96156'
                                                          },
                                                   '1' => {
                                                            'name' => 'allocations',
                                                            'offset' => '4',
                                                            'type' => '180'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_tid_state',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '96575' => {
                                       'Header' => undef,
                                       'Line' => '23',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state',
                                                            'offset' => '0',
                                                            'type' => '96617'
                                                          },
                                                   '1' => {
                                                            'name' => 'lock_db_fd',
                                                            'offset' => '8264',
                                                            'type' => '74'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_instance_db',
                                       'PrivateABI' => 1,
                                       'Size' => '2052',
                                       'Type' => 'Struct'
                                     },
                          '96617' => {
                                       'BaseType' => '96536',
                                       'Name' => 'struct pldm_tid_state[256]',
                                       'Size' => '2048',
                                       'Type' => 'Array'
                                     },
                          '969' => {
                                     'BaseType' => '890',
                                     'Name' => 'struct pldm_header_info const',
                                     'Size' => '8',
                                     'Type' => 'Const'
                                   },
                          '97045' => {
                                       'BaseType' => '96575',
                                       'Name' => 'struct pldm_instance_db*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '97471' => {
                                       'BaseType' => '96156',
                                       'Name' => 'pldm_instance_id_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '97647' => {
                                       'BaseType' => '97045',
                                       'Name' => 'struct pldm_instance_db**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '98159' => {
                                       'BaseType' => '168',
                                       'Header' => 'pldm.h',
                                       'Line' => '12',
                                       'Name' => 'mctp_eid_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '98171' => {
                                       'Header' => 'pldm.h',
                                       'Line' => '14',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_REQUESTER_SUCCESS',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_REQUESTER_OPEN_FAIL',
                                                            'value' => '18446744073709551615 (-1)'
                                                          },
                                                   '10' => {
                                                             'name' => 'PLDM_REQUESTER_SETUP_FAIL',
                                                             'value' => '18446744073709551606 (-10)'
                                                           },
                                                   '11' => {
                                                             'name' => 'PLDM_REQUESTER_INVALID_SETUP',
                                                             'value' => '18446744073709551605 (-11)'
                                                           },
                                                   '12' => {
                                                             'name' => 'PLDM_REQUESTER_POLL_FAIL',
                                                             'value' => '18446744073709551604 (-12)'
                                                           },
                                                   '2' => {
                                                            'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
                                                            'value' => '18446744073709551614 (-2)'
                                                          },
                                                   '3' => {
                                                            'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
                                                            'value' => '18446744073709551613 (-3)'
                                                          },
                                                   '4' => {
                                                            'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
                                                            'value' => '18446744073709551612 (-4)'
                                                          },
                                                   '5' => {
                                                            'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
                                                            'value' => '18446744073709551611 (-5)'
                                                          },
                                                   '6' => {
                                                            'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
                                                            'value' => '18446744073709551610 (-6)'
                                                          },
                                                   '7' => {
                                                            'name' => 'PLDM_REQUESTER_SEND_FAIL',
                                                            'value' => '18446744073709551609 (-7)'
                                                          },
                                                   '8' => {
                                                            'name' => 'PLDM_REQUESTER_RECV_FAIL',
                                                            'value' => '18446744073709551608 (-8)'
                                                          },
                                                   '9' => {
                                                            'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
                                                            'value' => '18446744073709551607 (-9)'
                                                          }
                                                 },
                                       'Name' => 'enum pldm_requester_error_codes',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '98268' => {
                                       'BaseType' => '98171',
                                       'Header' => 'pldm.h',
                                       'Line' => '28',
                                       'Name' => 'pldm_requester_rc_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '98411' => {
                                       'Header' => undef,
                                       'Line' => '20',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'transport',
                                                            'offset' => '0',
                                                            'type' => '98484'
                                                          },
                                                   '1' => {
                                                            'name' => 'socket',
                                                            'offset' => '64',
                                                            'type' => '74'
                                                          },
                                                   '2' => {
                                                            'name' => 'tid_eid_map',
                                                            'offset' => '68',
                                                            'type' => '101515'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_transport_mctp_demux',
                                       'PrivateABI' => 1,
                                       'Size' => '304',
                                       'Type' => 'Struct'
                                     },
                          '98437' => {
                                       'BaseType' => '98411',
                                       'Name' => 'struct pldm_transport_mctp_demux*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '98479' => {
                                       'BaseType' => '98484',
                                       'Name' => 'struct pldm_transport*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '98484' => {
                                       'Header' => undef,
                                       'Line' => '21',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '12549'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '8',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'recv',
                                                            'offset' => '22',
                                                            'type' => '100856'
                                                          },
                                                   '3' => {
                                                            'name' => 'send',
                                                            'offset' => '36',
                                                            'type' => '100897'
                                                          },
                                                   '4' => {
                                                            'name' => 'init_pollfd',
                                                            'offset' => '50',
                                                            'type' => '100978'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_transport',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '98718' => {
                                       'BaseType' => '98437',
                                       'Name' => 'struct pldm_transport_mctp_demux**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     }
                        },
          'UndefinedSymbols' => {
                                  'libpldm.so.0.2.0' => {
                                                          '_ITM_deregisterTMCloneTable' => 0,
                                                          '_ITM_registerTMCloneTable' => 0,
                                                          '__assert_fail@GLIBC_2.2.5' => 0,
                                                          '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                          '__errno_location@GLIBC_2.2.5' => 0,
                                                          '__gmon_start__' => 0,
                                                          '__stack_chk_fail@GLIBC_2.4' => 0,
                                                          'calloc@GLIBC_2.2.5' => 0,
                                                          'clock_gettime@GLIBC_2.17' => 0,
                                                          'close@GLIBC_2.2.5' => 0,
                                                          'connect@GLIBC_2.2.5' => 0,
                                                          'dup@GLIBC_2.2.5' => 0,
                                                          'fcntl64@GLIBC_2.28' => 0,
                                                          'free@GLIBC_2.2.5' => 0,
                                                          'malloc@GLIBC_2.2.5' => 0,
                                                          'memcmp@GLIBC_2.2.5' => 0,
                                                          'memcpy@GLIBC_2.14' => 0,
                                                          'open64@GLIBC_2.2.5' => 0,
                                                          'recv@GLIBC_2.2.5' => 0,
                                                          'recvmsg@GLIBC_2.2.5' => 0,
                                                          'sendmsg@GLIBC_2.2.5' => 0,
                                                          'sendto@GLIBC_2.2.5' => 0,
                                                          'socket@GLIBC_2.2.5' => 0,
                                                          'stat64@GLIBC_2.33' => 0,
                                                          'strlen@GLIBC_2.2.5' => 0,
                                                          'write@GLIBC_2.2.5' => 0
                                                        }
                                },
          'WordSize' => '8'
        };
