$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '13.1.0',
          'Headers' => {
                         'base.h' => 1,
                         'bios.h' => 1,
                         'bios_table.h' => 1,
                         'file_io.h' => 1,
                         'firmware_update.h' => 1,
                         'fru.h' => 1,
                         'host.h' => 1,
                         'instance-id.h' => 1,
                         'pdr.h' => 1,
                         'platform.h' => 1,
                         'platform_oem_ibm.h' => 1,
                         'pldm.h' => 1,
                         'pldm_types.h' => 1,
                         'utils.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libpldm.so.0.4.0',
          'LibraryVersion' => '0.4.0',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'base.c' => 1,
                         'bios.c' => 1,
                         'bios_table.c' => 1,
                         'file_io.c' => 1,
                         'firmware_update.c' => 1,
                         'fru.c' => 1,
                         'host.c' => 1,
                         'instance-id.c' => 1,
                         'pdr.c' => 1,

                                                 'pldm_entity_association_tree_visit' => 1,
                                                 'pldm_entity_extract' => 1,
                                                 'pldm_entity_get_num_children' => 1,
                                                 'pldm_entity_get_parent' => 1,
                                                 'pldm_entity_is_exist_parent' => 1,
                                                 'pldm_entity_is_node_parent' => 1,
                                                 'pldm_find_entity_ref_in_tree' => 1,
                                                 'pldm_instance_db_destroy' => 1,
                                                 'pldm_instance_db_init' => 1,
                                                 'pldm_instance_db_init_default' => 1,
                                                 'pldm_instance_id_alloc' => 1,
                                                 'pldm_instance_id_free' => 1,
                                                 'pldm_is_current_parent_child' => 1,
                                                 'pldm_is_empty_entity_assoc_tree' => 1,
                                                 'pldm_open' => 1,
                                                 'pldm_pdr_add_check' => 1,
                                                 'pldm_pdr_add_fru_record_set_check' => 1,
                                                 'pldm_pdr_destroy' => 1,
                                                 'pldm_pdr_find_record' => 1,
                                                 'pldm_pdr_find_record_by_type' => 1,
                                                 'pldm_pdr_fru_record_set_find_by_rsi' => 1,
                                                 'pldm_pdr_get_next_record' => 1,
                                                 'pldm_pdr_get_record_count' => 1,
                                                 'pldm_pdr_get_record_handle' => 1,
                                                 'pldm_pdr_get_repo_size' => 1,
                                                 'pldm_pdr_init' => 1,
                                                 'pldm_pdr_record_is_remote' => 1,
                                                 'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
                                                 'pldm_pdr_remove_remote_pdrs' => 1,
                                                 'pldm_pdr_update_TL_pdr' => 1,
                                                 'pldm_recv' => 1,
                                                 'pldm_recv_any' => 1,
                                                 'pldm_send' => 1,
                                                 'pldm_send_recv' => 1,
                                                 'unpack_pldm_header' => 1,
                                                 'ver2str' => 1
                                               }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '102' => {
                                     'Name' => 'unsigned long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '109' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '116' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '123' => {
                                     'BaseType' => '102',
                                     'Header' => 'stddef.h',
                                     'Line' => '214',
                                     'Name' => 'size_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '12326' => {
                                       'BaseType' => '116',
                                       'Name' => 'char*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12343' => {
                                       'BaseType' => '116',
                                       'Name' => 'char const',
                                       'Size' => '1',
                                       'Type' => 'Const'
                                     },
                          '12360' => {
                                       'BaseType' => '123',
                                       'Name' => 'size_t const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '12372' => {
                                       'BaseType' => '46',
                                       'Header' => 'types.h',
                                       'Line' => '37',
                                       'Name' => '__int8_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '12396' => {
                                       'BaseType' => '60',
                                       'Header' => 'types.h',
                                       'Line' => '39',
                                       'Name' => '__int16_t',
                                       'PrivateABI' => 1,
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '12420' => {
                                       'BaseType' => '74',
                                       'Header' => 'types.h',
                                       'Line' => '41',
                                       'Name' => '__int32_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '12451' => {
                                       'BaseType' => '109',
                                       'Header' => 'types.h',
                                       'Line' => '194',
                                       'Name' => '__ssize_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12463' => {
                                       'BaseType' => '12372',
                                       'Header' => 'stdint-intn.h',
                                       'Line' => '24',
                                       'Name' => 'int8_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '12475' => {
                                       'BaseType' => '12396',
                                       'Header' => 'stdint-intn.h',
                                       'Line' => '25',
                                       'Name' => 'int16_t',
                                       'PrivateABI' => 1,
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '12487' => {
                                       'BaseType' => '12420',
                                       'Header' => 'stdint-intn.h',
                                       'Line' => '26',
                                       'Name' => 'int32_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '12528' => {
                                       'BaseType' => '5485',
                                       'Name' => 'uint16_t const',
                                       'Size' => '2',
                                       'Type' => 'Const'
                                     },
                          '12545' => {
                                       'BaseType' => '185',
                                       'Name' => 'uint32_t const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '12716' => {
                                       'BaseType' => '173',
                                       'Header' => 'pldm_types.h',
                                       'Line' => '31',
                                       'Name' => 'bool8_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '12728' => {
                                       'BaseType' => '451',
                                       'Header' => 'pldm_types.h',
                                       'Line' => '163',
                                       'Name' => 'real32_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '13269' => {
                                       'BaseType' => '12343',
                                       'Name' => 'char const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13274' => {
                                       'BaseType' => '12451',
                                       'Header' => 'types.h',
                                       'Line' => '108',
                                       'Name' => 'ssize_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '13810' => {
                                       'Header' => 'platform.h',
                                       'Line' => '237',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_SENSOR_OP_STATE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_STATE_SENSOR_STATE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_NUMERIC_SENSOR_STATE',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum sensor_event_class_states',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '13844' => {
                                       'BaseType' => '13810',
                                       'Name' => 'enum sensor_event_class_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '14067' => {
                                       'Header' => 'platform.h',
                                       'Line' => '454',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '185'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '4',
                                                            'type' => '173'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '5',
                                                            'type' => '173'
                                                          },
                                                   '3' => {
                                                            'name' => 'record_change_num',
                                                            'offset' => '6',
                                                            'type' => '5485'
                                                          },
                                                   '4' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '5485'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_hdr',
                                       'Size' => '10',
                                       'Type' => 'Struct'
                                     },
                          '14146' => {
                                       'Header' => 'platform.h',
                                       'Line' => '529',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '14067'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '16',
                                                            'type' => '5485'
                                                          },
                                                   '2' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '18',
                                                            'type' => '5485'
                                                          },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '20',
                                                            'type' => '5485'
                                                          },
                                                   '4' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '22',
                                                            'type' => '5485'
                                                          },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '24',
                                                            'type' => '5485'
                                                          },
                                                   '6' => {
                                                            'name' => 'sensor_init',
                                                            'offset' => '32',
                                                            'type' => '173'
                                                          },
                                                   '7' => {
                                                            'name' => 'sensor_auxiliary_names_pdr',
                                                            'offset' => '33',
                                                            'type' => '12716'
                                                          },
                                                   '8' => {
                                                            'name' => 'composite_sensor_count',
                                                            'offset' => '34',
                                                            'type' => '173'
                                                          },
                                                   '9' => {
                                                            'name' => 'possible_states',
                                                            'offset' => '35',
                                                            'type' => '879'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_state_sensor_pdr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '142' => {
                                     'BaseType' => '53',
                                     'Header' => 'types.h',
                                     'Line' => '38',
                                     'Name' => '__uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '14290' => {
                                       'Header' => 'platform.h',
                                       'Line' => '546',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state_set_id',
                                                            'offset' => '0',
                                                            'type' => '5485'
                                                          },
                                                   '1' => {
                                                            'name' => 'possible_states_size',
                                                            'offset' => '2',
                                                            'type' => '173'
                                                          },
                                                   '2' => {
                                                            'name' => 'states',
                                                            'offset' => '3',
                                                            'type' => '14348'
                                                          }
                                                 },
                                       'Name' => 'struct state_sensor_possible_states',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '14343' => {
                                       'BaseType' => '14290',
                                       'Name' => 'struct state_sensor_possible_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '14348' => {
                                       'BaseType' => '351',
                                       'Name' => 'bitfield8_t[1]',
                                       'Size' => '1',
                                       'Type' => 'Array'
                                     },
                          '14364' => {
                                       'Header' => 'platform.h',
                                       'Line' => '556',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '14067'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '16',
                                                            'type' => '5485'
                                                          },
                                                   '10' => {
                                                             'name' => 'possible_states',
                                                             'offset' => '37',
                                                             'type' => '879'
                                                           },
                                                   '2' => {
                                                            'name' => 'effecter_id',
                                                            'offset' => '18',
                                                            'type' => '5485'
                                                          },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '20',
                                                            'type' => '5485'
                                                          },
                                                   '4' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '22',
                                                            'type' => '5485'
                                                          },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '24',
                                                            'type' => '5485'
                                                          },
                                                   '6' => {
                                                            'name' => 'effecter_semantic_id',
                                                            'offset' => '32',
                                                            'type' => '5485'
                                                          },
                                                   '7' => {
                                                            'name' => 'effecter_init',
                                                            'offset' => '34',
                                                            'type' => '173'
                                                          },
                                                   '8' => {
                                                            'name' => 'has_description_pdr',
                                                            'offset' => '35',
                                                            'type' => '12716'
                                                          },
                                                   '9' => {
                                                            'name' => 'composite_effecter_count',
                                                            'offset' => '36',
                                                            'type' => '173'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_state_effecter_pdr',
                                       'Size' => '26',
                                       'Type' => 'Struct'
                                     },
                          '14615' => {
                                       'Header' => 'platform.h',
                                       'Line' => '647',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value_u8',
                                                            'offset' => '0',
                                                            'type' => '173'
                                                          },
                                                   '1' => {
                                                            'name' => 'value_s8',
                                                            'offset' => '0',
                                                            'type' => '12463'
                                                          },
                                                   '2' => {
                                                            'name' => 'value_u16',
                                                            'offset' => '0',
                                                            'type' => '5485'
                                                          },
                                                   '3' => {
                                                            'name' => 'value_s16',
                                                            'offset' => '0',
                                                            'type' => '12475'
                                                          },
                                                   '4' => {
                                                            'name' => 'value_u32',
                                                            'offset' => '0',
                                                            'type' => '185'
                                                          },
                                                   '5' => {
                                                            'name' => 'value_s32',
                                                            'offset' => '0',
                                                            'type' => '12487'
                                                          },
                                                   '6' => {
                                                            'name' => 'value_f32',
                                                            'offset' => '0',
                                                            'type' => '12728'
                                                          }
                                                 },
                                       'Name' => 'union union_range_field_format',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '14709' => {
                                       'Header' => 'platform.h',
                                       'Line' => '704',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value_u8',
                                                            'offset' => '0',
                                                            'type' => '173'
                                                          },
                                                   '1' => {
                                                            'name' => 'value_s8',
                                                            'offset' => '0',
                                                            'type' => '12463'
                                                          },
                                                   '2' => {
                                                            'name' => 'value_u16',
                                                            'offset' => '0',
                                                            'type' => '5485'
                                                          },
                                                   '3' => {
                                                            'name' => 'value_s16',
                                                            'offset' => '0',
                                                            'type' => '12475'
                                                          },
                                                   '4' => {
                                                            'name' => 'value_u32',
                                                            'offset' => '0',
                                                            'type' => '185'
                                                          },
                                                   '5' => {
                                                            'name' => 'value_s32',
                                                            'offset' => '0',
                                                            'type' => '12487'
                                                          }
                                                 },
                                       'Name' => 'union union_sensor_data_size',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '14721' => {
                                       'Header' => 'platform.h',
                                       'Line' => '711',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '185'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '4',
                                                            'type' => '173'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '5',
                                                            'type' => '173'
                                                          },
                                                   '3' => {
                                                            'name' => 'record_change_num',
                                                            'offset' => '6',
                                                            'type' => '5485'
                                                          },
                                                   '4' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '5485'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_value_pdr_hdr',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '14800' => {
                                       'Header' => 'platform.h',
                                       'Line' => '729',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity_instance_num',
                                                            'offset' => '0',
                                                            'type' => '5485'
                                                          },
                                                   '1' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '0',
                                                            'type' => '5485'
                                                          }
                                                 },
                                       'Name' => 'anon-union-platform.h-729',
                                       'Size' => '2',
                                       'Type' => 'Union'
                                     },
                          '14834' => {
                                       'Header' => 'platform.h',
                                       'Line' => '724',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '14721'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '18',
                                                            'type' => '5485'
                                                          },
                                                   '10' => {
                                                             'name' => 'rate_unit',
                                                             'offset' => '38',
                                                             'type' => '173'
                                                           },
                                                   '11' => {
                                                             'name' => 'base_oem_unit_handle',
                                                             'offset' => '39',
                                                             'type' => '173'
                                                           },
                                                   '12' => {
                                                             'name' => 'aux_unit',
                                                             'offset' => '40',
                                                             'type' => '173'
                                                           },
                                                   '13' => {
                                                             'name' => 'aux_unit_modifier',
                                                             'offset' => '41',
                                                             'type' => '12463'
                                                           },
                                                   '14' => {
                                                             'name' => 'aux_rate_unit',
                                                             'offset' => '48',
                                                             'type' => '173'
                                                           },
                                                   '15' => {
                                                             'name' => 'rel',
                                                             'offset' => '49',
                                                             'type' => '173'
                                                           },
                                                   '16' => {
                                                             'name' => 'aux_oem_unit_handle',
                                                             'offset' => '50',
                                                             'type' => '173'
                                                           },
                                                   '17' => {
                                                             'name' => 'is_linear',
                                                             'offset' => '51',
                                                             'type' => '12716'
                                                           },
                                                   '18' => {
                                                             'name' => 'sensor_data_size',
                                                             'offset' => '52',
                                                             'type' => '173'
                                                           },
                                                   '19' => {
                                                             'name' => 'resolution',
                                                             'offset' => '54',
                                                             'type' => '12728'
                                                           },
                                                   '2' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '20',
                                                            'type' => '5485'
                                                          },
                                                   '20' => {
                                                             'name' => 'offset',
                                                             'offset' => '64',
                                                             'type' => '12728'
                                                           },
                                                   '21' => {
                                                             'name' => 'accuracy',
                                                             'offset' => '68',
                                                             'type' => '5485'
                                                           },
                                                   '22' => {
                                                             'name' => 'plus_tolerance',
                                                             'offset' => '70',
                                                             'type' => '173'
                                                           },
                                                   '23' => {
                                                             'name' => 'minus_tolerance',
                                                             'offset' => '71',
                                                             'type' => '173'
                                                           },
                                                   '24' => {
                                                             'name' => 'hysteresis',
                                                             'offset' => '72',
                                                             'type' => '14709'
                                                           },
                                                   '25' => {
                                                             'name' => 'supported_thresholds',
                                                             'offset' => '82',
                                                             'type' => '351'
                                                           },
                                                   '26' => {
                                                             'name' => 'threshold_and_hysteresis_volatility',
                                                             'offset' => '83',
                                                             'type' => '351'
                                                           },
                                                   '27' => {
                                                             'name' => 'state_transition_interval',
                                                             'offset' => '86',
                                                             'type' => '12728'
                                                           },
                                                   '28' => {
                                                             'name' => 'update_interval',
                                                             'offset' => '96',
                                                             'type' => '12728'
                                                           },
                                                   '29' => {
                                                             'name' => 'max_readable',
                                                             'offset' => '100',
                                                             'type' => '14709'
                                                           },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '22',
                                                            'type' => '5485'
                                                          },
                                                   '30' => {
                                                             'name' => 'min_readable',
                                                             'offset' => '104',
                                                             'type' => '14709'
                                                           },
                                                   '31' => {
                                                             'name' => 'range_field_format',
                                                             'offset' => '114',
                                                             'type' => '173'
                                                           },
                                                   '32' => {
                                                             'name' => 'range_field_support',
                                                             'offset' => '115',
                                                             'type' => '351'
                                                           },
                                                   '33' => {
                                                             'name' => 'nominal_value',
                                                             'offset' => '118',
                                                             'type' => '14615'
                                                           },
                                                   '34' => {
                                                             'name' => 'normal_max',
                                                             'offset' => '128',
                                                             'type' => '14615'
                                                           },
                                                   '35' => {
                                                             'name' => 'normal_min',
                                                             'offset' => '132',
                                                             'type' => '14615'
                                                           },
                                                   '36' => {
                                                             'name' => 'warning_high',
                                                             'offset' => '136',
                                                             'type' => '14615'
                                                           },
                                                   '37' => {
                                                             'name' => 'warning_low',
                                                             'offset' => '146',
                                                             'type' => '14615'
                                                           },
                                                   '38' => {
                                                             'name' => 'critical_high',
                                                             'offset' => '150',
                                                             'type' => '14615'
                                                           },
                                                   '39' => {
                                                             'name' => 'critical_low',
                                                             'offset' => '256',
                                                             'type' => '14615'
                                                           },
                                                   '4' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '24',
                                                            'type' => '14800'
                                                          },
                                                   '40' => {
                                                             'name' => 'fatal_high',
                                                             'offset' => '260',
                                                             'type' => '14615'
                                                           },
                                                   '41' => {
                                                             'name' => 'fatal_low',
                                                             'offset' => '264',
                                                             'type' => '14615'
                                                           },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '32',
                                                            'type' => '5485'
                                                          },
                                                   '6' => {
                                                            'name' => 'sensor_init',
                                                            'offset' => '34',
                                                            'type' => '173'
                                                          },
                                                   '7' => {
                                                            'name' => 'sensor_auxiliary_names_pdr',
                                                            'offset' => '35',
                                                            'type' => '12716'
                                                          },
                                                   '8' => {
                                                            'name' => 'base_unit',
                                                            'offset' => '36',
                                                            'type' => '173'
                                                          },
                                                   '9' => {
                                                            'name' => 'unit_modifier',
                                                            'offset' => '37',
                                                            'type' => '12463'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_numeric_sensor_value_pdr',
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '15387' => {
                                       'Header' => 'platform.h',
                                       'Line' => '776',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state_set_id',
                                                            'offset' => '0',
                                                            'type' => '5485'
                                                          },
                                                   '1' => {
                                                            'name' => 'possible_states_size',
                                                            'offset' => '2',
                                                            'type' => '173'
                                                          },
                                                   '2' => {
                                                            'name' => 'states',
                                                            'offset' => '3',
                                                            'type' => '14348'
                                                          }
                                                 },
                                       'Name' => 'struct state_effecter_possible_states',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '154' => {
                                     'BaseType' => '81',
                                     'Header' => 'types.h',
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '15440' => {
                                       'BaseType' => '15387',
                                       'Name' => 'struct state_effecter_possible_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '15445' => {
                                       'Header' => 'platform.h',
                                       'Line' => '824',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'set_request',
                                                            'offset' => '0',
                                                            'type' => '173'
                                                          },
                                                   '1' => {
                                                            'name' => 'effecter_state',
                                                            'offset' => '1',
                                                            'type' => '173'
                                                          }
                                                 },
                                       'Name' => 'struct state_field_for_state_effecter_set',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '15485' => {
                                       'BaseType' => '15445',
                                       'Header' => 'platform.h',
                                       'Line' => '827',
                                       'Name' => 'set_effecter_state_field',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '15497' => {
                                       'Header' => 'platform.h',
                                       'Line' => '833',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sensor_op_state',
                                                            'offset' => '0',
                                                            'type' => '173'
                                                          },
                                                   '1' => {
                                                            'name' => 'present_state',
                                                            'offset' => '1',
                                                            'type' => '173'
                                                          },
                                                   '2' => {
                                                            'name' => 'previous_state',
                                                            'offset' => '2',
                                                            'type' => '173'
                                                          },
                                                   '3' => {
                                                            'name' => 'event_state',
                                                            'offset' => '3',
                                                            'type' => '173'
                                                          }
                                                 },
                                       'Name' => 'struct state_field_for_get_state_sensor_readings',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '15563' => {
                                       'BaseType' => '15497',
                                       'Header' => 'platform.h',
                                       'Line' => '841',
                                       'Name' => 'get_sensor_state_field',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '15762' => {
                                       'BaseType' => '173',
                                       'Name' => 'uint8_t[13]',
                                       'Size' => '13',
                                       'Type' => 'Array'
                                     },
                          '1599' => {
                                      'BaseType' => '835',
                                      'Name' => 'struct pldm_msg*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '16244' => {
                                       'Header' => 'platform.h',
                                       'Line' => '978',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '0',
                                                            'type' => '5485'
                                                          },
                                                   '1' => {
                                                            'name' => 'sensor_event_class_type',
                                                            'offset' => '2',
                                                            'type' => '173'
                                                          },
                                                   '2' => {
                                                            'name' => 'event_class',
                                                            'offset' => '3',
                                                            'type' => '879'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_sensor_event_data',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '16456' => {
                                       'Header' => 'platform.h',
                                       'Line' => '1059',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'event_data_format',
                                                            'offset' => '0',
                                                            'type' => '173'
                                                          },
                                                   '1' => {
                                                            'name' => 'number_of_change_records',
                                                            'offset' => '1',
                                                            'type' => '173'
                                                          },
                                                   '2' => {
                                                            'name' => 'change_records',
                                                            'offset' => '2',
                                                            'type' => '879'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_repository_chg_event_data',
                                       'Size' => '3',
                                       'Type' => 'Struct'
                                     },
                          '166' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '173' => {
                                     'BaseType' => '142',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '24',
                                     'Name' => 'uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '17655' => {
                                       'BaseType' => '166',
                                       'Name' => 'void**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '185' => {
                                     'BaseType' => '154',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '26',
                                     'Name' => 'uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '197' => {
                                     'Header' => 'pldm_types.h',
                                     'Line' => '8',
                                     'Name' => 'anon-struct-pldm_types.h-8',
                                     'Size' => '1',
                                     'Type' => 'Struct'
                                   },
                          '2044' => {
                                      'BaseType' => '874',
                                      'Name' => 'struct pldm_msg const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2049' => {
                                      'BaseType' => '173',
                                      'Name' => 'uint8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2054' => {
                                      'BaseType' => '185',
                                      'Name' => 'uint32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '21978' => {
                                       'BaseType' => '9679',
                                       'Name' => 'size_t*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '23604' => {
                                       'BaseType' => '23614',
                                       'Name' => 'uint32_t const*const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '23609' => {
                                       'BaseType' => '12545',
                                       'Name' => 'uint32_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '23614' => {
                                       'BaseType' => '23609',
                                       'Name' => 'uint32_t const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '23619' => {
                                       'BaseType' => '16456',
                                       'Name' => 'struct pldm_pdr_repository_chg_event_data*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2944' => {
                                      'BaseType' => '434',
                                      'Name' => 'ver32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '30334' => {
                                       'BaseType' => '14834',
                                       'Name' => 'struct pldm_numeric_sensor_value_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '3447' => {
                                      'BaseType' => '446',
                                      'Name' => 'ver32_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '351' => {
                                     'Header' => 'pldm_types.h',
                                     'Line' => '18',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'byte',
                                                          'offset' => '0',
                                                          'type' => '173'
                                                        },
                                                 '1' => {
                                                          'name' => 'bits',
                                                          'offset' => '0',
                                                          'type' => '197'
                                                        }
                                               },
                                     'Name' => 'union bitfield8_t',
                                     'Size' => '1',
                                     'Type' => 'Union'
                                   },
                          '363' => {
                                     'BaseType' => '351',
                                     'Name' => 'bitfield8_t const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '368' => {
                                     'Header' => 'pldm_types.h',
                                     'Line' => '24',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'alpha',
                                                          'offset' => '0',
                                                          'type' => '173'
                                                        },
                                                 '1' => {
                                                          'name' => 'update',
                                                          'offset' => '1',
                                                          'type' => '173'
                                                        },
                                                 '2' => {
                                                          'name' => 'minor',
                                                          'offset' => '2',
                                                          'type' => '173'
                                                        },
                                                 '3' => {
                                                          'name' => 'major',
                                                          'offset' => '3',
                                                          'type' => '173'
                                                        }
                                               },
                                     'Name' => 'struct pldm_version',
                                     'Size' => '4',
                                     'Type' => 'Struct'
                                   },
                          '36997' => {
                                       'BaseType' => '16244',
                                       'Name' => 'struct pldm_sensor_event_data*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '37002' => {
                                       'BaseType' => '36997',
                                       'Name' => 'struct pldm_sensor_event_data*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '38008' => {
                                       'BaseType' => '15563',
                                       'Name' => 'get_sensor_state_field*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '3851' => {
                                      'BaseType' => '351',
                                      'Name' => 'bitfield8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4307' => {
                                      'BaseType' => '363',
                                      'Name' => 'bitfield8_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '434' => {
                                     'BaseType' => '368',
                                     'Header' => 'pldm_types.h',
                                     'Line' => '29',
                                     'Name' => 'ver32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '43625' => {
                                       'BaseType' => '15485',
                                       'Name' => 'set_effecter_state_field*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '446' => {
                                     'BaseType' => '434',
                                     'Name' => 'ver32_t const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '44604' => {
                                       'BaseType' => '14146',
                                       'Name' => 'struct pldm_state_sensor_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '44609' => {
                                       'BaseType' => '44604',
                                       'Name' => 'struct pldm_state_sensor_pdr*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '44614' => {
                                       'BaseType' => '14343',
                                       'Name' => 'struct state_sensor_possible_states const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '44619' => {
                                       'BaseType' => '44614',
                                       'Name' => 'struct state_sensor_possible_states const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '45015' => {
                                       'BaseType' => '14364',
                                       'Name' => 'struct pldm_state_effecter_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '45020' => {
                                       'BaseType' => '45015',
                                       'Name' => 'struct pldm_state_effecter_pdr*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '45025' => {
                                       'BaseType' => '15440',
                                       'Name' => 'struct state_effecter_possible_states const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '45030' => {
                                       'BaseType' => '45025',
                                       'Name' => 'struct state_effecter_possible_states const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '451' => {
                                     'Name' => 'float',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '46' => {
                                    'Name' => 'signed char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '49482' => {
                                       'BaseType' => '102',
                                       'Header' => 'types.h',
                                       'Line' => '45',
                                       'Name' => '__uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '49576' => {
                                       'BaseType' => '49482',
                                       'Header' => 'stdint-uintn.h',
                                       'Line' => '27',
                                       'Name' => 'uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '49588' => {
                                       'Header' => 'bios.h',
                                       'Line' => '38',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_BIOS_STRING_TABLE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_BIOS_ATTR_TABLE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum pldm_bios_table_types',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '49622' => {
                                       'Header' => 'bios.h',
                                       'Line' => '47',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'string_handle',
                                                            'offset' => '0',
                                                            'type' => '5485'
                                                          },
                                                   '1' => {
                                                            'name' => 'string_length',
                                                            'offset' => '2',
                                                            'type' => '5485'
                                                          },
                                                   '2' => {
                                                            'name' => 'name',
                                                            'offset' => '4',
                                                            'type' => '49679'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_string_table_entry',
                                       'Size' => '5',
                                       'Type' => 'Struct'
                                     },
                          '49674' => {
                                       'BaseType' => '49622',
                                       'Name' => 'struct pldm_bios_string_table_entry const',
                                       'Size' => '5',
                                       'Type' => 'Const'
                                     },
                          '49679' => {
                                       'BaseType' => '116',
                                       'Name' => 'char[1]',
                                       'Size' => '1',
                                       'Type' => 'Array'
                                     },
                          '49695' => {
                                       'Header' => 'bios.h',
                                       'Line' => '53',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_handle',
                                                            'offset' => '0',
                                                            'type' => '5485'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_type',
                                                            'offset' => '2',
                                                            'type' => '173'
                                                          },
                                                   '2' => {
                                                            'name' => 'string_handle',
                                                            'offset' => '3',
                                                            'type' => '5485'
                                                          },
                                                   '3' => {
                                                            'name' => 'metadata',
                                                            'offset' => '5',
                                                            'type' => '879'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_attr_table_entry',
                                       'Size' => '6',
                                       'Type' => 'Struct'
                                     },
                          '49760' => {
                                       'BaseType' => '49695',
                                       'Name' => 'struct pldm_bios_attr_table_entry const',
                                       'Size' => '6',
                                       'Type' => 'Const'
                                     },
                          '49781' => {
                                       'Header' => 'bios.h',
                                       'Line' => '65',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_handle',
                                                            'offset' => '0',
                                                            'type' => '5485'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_type',
                                                            'offset' => '2',
                                                            'type' => '173'
                                                          },
                                                   '2' => {
                                                            'name' => 'value',
                                                            'offset' => '3',
                                                            'type' => '879'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_attr_val_table_entry',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '49833' => {
                                       'BaseType' => '49781',
                                       'Name' => 'struct pldm_bios_attr_val_table_entry const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '49902' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '204',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5485'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '6812'
                                                          },
                                                   '2' => {
                                                            'name' => 'pv_num',
                                                            'offset' => '3',
                                                            'type' => '173'
                                                          },
                                                   '3' => {
                                                            'name' => 'pv_handle',
                                                            'offset' => '8',
                                                            'type' => '50005'
                                                          },
                                                   '4' => {
                                                            'name' => 'def_num',
                                                            'offset' => '22',
                                                            'type' => '173'
                                                          },
                                                   '5' => {
                                                            'name' => 'def_index',
                                                            'offset' => '36',
                                                            'type' => '6677'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '49993' => {
                                       'BaseType' => '49902',
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '50005' => {
                                       'BaseType' => '12528',
                                       'Name' => 'uint16_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '50015' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '292',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5485'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '6812'
                                                          },
                                                   '2' => {
                                                            'name' => 'string_type',
                                                            'offset' => '3',
                                                            'type' => '173'
                                                          },
                                                   '3' => {
                                                            'name' => 'min_length',
                                                            'offset' => '4',
                                                            'type' => '5485'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_length',
                                                            'offset' => '6',
                                                            'type' => '5485'
                                                          },
                                                   '5' => {
                                                            'name' => 'def_length',
                                                            'offset' => '8',
                                                            'type' => '5485'
                                                          },
                                                   '6' => {
                                                            'name' => 'def_string',
                                                            'offset' => '22',
                                                            'type' => '13269'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '50127' => {
                                       'BaseType' => '50015',
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '50137' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '382',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5485'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '6812'
                                                          },
                                                   '2' => {
                                                            'name' => 'lower_bound',
                                                            'offset' => '8',
                                                            'type' => '49576'
                                                          },
                                                   '3' => {
                                                            'name' => 'upper_bound',
                                                            'offset' => '22',
                                                            'type' => '49576'
                                                          },
                                                   '4' => {
                                                            'name' => 'scalar_increment',
                                                            'offset' => '36',
                                                            'type' => '185'
                                                          },
                                                   '5' => {
                                                            'name' => 'default_value',
                                                            'offset' => '50',
                                                            'type' => '49576'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '50235' => {
                                       'BaseType' => '50137',
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
                                       'Size' => '40',
                                       'Type' => 'Const'
                                     },
                          '50596' => {
                                       'Name' => 'ssize_t(*)(void const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5228'
                                                           }
                                                  },
                                       'Return' => '13274',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '50666' => {
                                       'Line' => '935',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'table_data',
                                                            'offset' => '0',
                                                            'type' => '6677'
                                                          },
                                                   '1' => {
                                                            'name' => 'table_len',
                                                            'offset' => '8',
                                                            'type' => '123'
                                                          },
                                                   '2' => {
                                                            'name' => 'current_pos',
                                                            'offset' => '22',
                                                            'type' => '123'
                                                          },
                                                   '3' => {
                                                            'name' => 'entry_length_handler',
                                                            'offset' => '36',
                                                            'type' => '50596'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_iter',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Source' => 'bios_table.c',
                                       'Type' => 'Struct'
                                     },
                          '50736' => {
                                       'BaseType' => '50666',
                                       'Name' => 'struct pldm_bios_table_iter const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '5078' => {
                                      'BaseType' => '830',
                                      'Name' => 'struct pldm_msg_hdr const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5083' => {
                                      'BaseType' => '895',
                                      'Name' => 'struct pldm_header_info*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5173' => {
                                      'BaseType' => '974',
                                      'Name' => 'struct pldm_header_info const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5178' => {
                                      'BaseType' => '719',
                                      'Name' => 'struct pldm_msg_hdr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '51806' => {
                                       'BaseType' => '50666',
                                       'Name' => 'struct pldm_bios_table_iter*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51811' => {
                                       'BaseType' => '49833',
                                       'Name' => 'struct pldm_bios_attr_val_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '52226' => {
                                       'BaseType' => '49760',
                                       'Name' => 'struct pldm_bios_attr_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '5228' => {
                                      'BaseType' => '5238',
                                      'Name' => 'void const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5238' => {
                                      'BaseType' => '1',
                                      'Name' => 'void const',
                                      'Type' => 'Const'
                                    },
                          '52832' => {
                                       'BaseType' => '49674',
                                       'Name' => 'struct pldm_bios_string_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '53' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '53999' => {
                                       'BaseType' => '50736',
                                       'Name' => 'struct pldm_bios_table_iter const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '5430' => {
                                      'BaseType' => '67',
                                      'Header' => 'types.h',
                                      'Line' => '40',
                                      'Name' => '__uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '5480' => {
                                      'BaseType' => '173',
                                      'Name' => 'uint8_t const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '5485' => {
                                      'BaseType' => '5430',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '58272' => {
                                       'BaseType' => '49576',
                                       'Name' => 'uint64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '58549' => {
                                       'BaseType' => '50235',
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '58858' => {
                                       'BaseType' => '13269',
                                       'Name' => 'char const**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '60' => {
                                    'Name' => 'short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '60030' => {
                                       'BaseType' => '50127',
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '61528' => {
                                       'BaseType' => '49993',
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '63738' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '35',
                                       'Name' => 'anon-struct-pldm_types.h-35',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '64000' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '53',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '5485'
                                                          },
                                                   '1' => {
                                                            'name' => 'bits',
                                                            'offset' => '0',
                                                            'type' => '63738'
                                                          }
                                                 },
                                       'Name' => 'union bitfield16_t',
                                       'Size' => '2',
                                       'Type' => 'Union'
                                     },
                          '64012' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '57',
                                       'Name' => 'anon-struct-pldm_types.h-57',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '64498' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '91',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '185'
                                                          },
                                                   '1' => {
                                                            'name' => 'bits',
                                                            'offset' => '0',
                                                            'type' => '64012'
                                                          }
                                                 },
                                       'Name' => 'union bitfield32_t',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '64510' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '95',
                                       'Name' => 'anon-struct-pldm_types.h-95',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '65444' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '161',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '49576'
                                                          },
                                                   '1' => {
                                                            'name' => 'bits',
                                                            'offset' => '0',
                                                            'type' => '64510'
                                                          }
                                                 },
                                       'Name' => 'union bitfield64_t',
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '6638' => {
                                      'Header' => 'utils.h',
                                      'Line' => '18',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ptr',
                                                           'offset' => '0',
                                                           'type' => '6677'
                                                         },
                                                  '1' => {
                                                           'name' => 'length',
                                                           'offset' => '8',
                                                           'type' => '123'
                                                         }
                                                },
                                      'Name' => 'struct variable_field',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '6677' => {
                                      'BaseType' => '5480',
                                      'Name' => 'uint8_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '66995' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '329',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'uuid',
                                                            'offset' => '0',
                                                            'type' => '67099'
                                                          },
                                                   '1' => {
                                                            'name' => 'package_header_format_version',
                                                            'offset' => '22',
                                                            'type' => '173'
                                                          },
                                                   '2' => {
                                                            'name' => 'package_header_size',
                                                            'offset' => '23',
                                                            'type' => '5485'
                                                          },
                                                   '3' => {
                                                            'name' => 'package_release_date_time',
                                                            'offset' => '25',
                                                            'type' => '15762'
                                                          },
                                                   '4' => {
                                                            'name' => 'component_bitmap_bit_length',
                                                            'offset' => '50',
                                                            'type' => '5485'
                                                          },
                                                   '5' => {
                                                            'name' => 'package_version_string_type',
                                                            'offset' => '52',
                                                            'type' => '173'
                                                          },
                                                   '6' => {
                                                            'name' => 'package_version_string_length',
                                                            'offset' => '53',
                                                            'type' => '173'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_header_information',
                                       'Size' => '36',
                                       'Type' => 'Struct'
                                     },
                          '67' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '67099' => {
                                       'BaseType' => '173',
                                       'Name' => 'uint8_t[16]',
                                       'Size' => '16',
                                       'Type' => 'Array'
                                     },
                          '67131' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '343',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_length',
                                                            'offset' => '0',
                                                            'type' => '5485'
                                                          },
                                                   '1' => {
                                                            'name' => 'descriptor_count',
                                                            'offset' => '2',
                                                            'type' => '173'
                                                          },
                                                   '2' => {
                                                            'name' => 'device_update_option_flags',
                                                            'offset' => '3',
                                                            'type' => '64498'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_image_set_version_string_type',
                                                            'offset' => '7',
                                                            'type' => '173'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_image_set_version_string_length',
                                                            'offset' => '8',
                                                            'type' => '173'
                                                          },
                                                   '5' => {
                                                            'name' => 'fw_device_pkg_data_length',
                                                            'offset' => '9',
                                                            'type' => '5485'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_firmware_device_id_record',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '67326' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '377',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '5485'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '5485'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_comparison_stamp',
                                                            'offset' => '4',
                                                            'type' => '185'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_options',
                                                            'offset' => '8',
                                                            'type' => '64000'
                                                          },
                                                   '4' => {
                                                            'name' => 'requested_comp_activation_method',
                                                            'offset' => '16',
                                                            'type' => '64000'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_location_offset',
                                                            'offset' => '18',
                                                            'type' => '185'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_size',
                                                            'offset' => '22',
                                                            'type' => '185'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_version_string_type',
                                                            'offset' => '32',
                                                            'type' => '173'
                                                          },
                                                   '8' => {
                                                            'name' => 'comp_version_string_length',
                                                            'offset' => '33',
                                                            'type' => '173'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_component_image_information',
                                       'Size' => '22',
                                       'Type' => 'Struct'
                                     },
                          '67508' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '403',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '173'
                                                          },
                                                   '1' => {
                                                            'name' => 'capabilities_during_update',
                                                            'offset' => '1',
                                                            'type' => '64498'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_count',
                                                            'offset' => '5',
                                                            'type' => '5485'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_image_set_ver_str_type',
                                                            'offset' => '7',
                                                            'type' => '173'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_image_set_ver_str_len',
                                                            'offset' => '8',
                                                            'type' => '173'
                                                          },
                                                   '5' => {
                                                            'name' => 'pending_comp_image_set_ver_str_type',
                                                            'offset' => '9',
                                                            'type' => '173'
                                                          },
                                                   '6' => {
                                                            'name' => 'pending_comp_image_set_ver_str_len',
                                                            'offset' => '16',
                                                            'type' => '173'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_get_firmware_parameters_resp',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '67612' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '417',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '5485'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '5485'
                                                          },
                                                   '10' => {
                                                             'name' => 'pending_comp_release_date',
                                                             'offset' => '37',
                                                             'type' => '67794'
                                                           },
                                                   '11' => {
                                                             'name' => 'comp_activation_methods',
                                                             'offset' => '51',
                                                             'type' => '64000'
                                                           },
                                                   '12' => {
                                                             'name' => 'capabilities_during_update',
                                                             'offset' => '53',
                                                             'type' => '64498'
                                                           },
                                                   '2' => {
                                                            'name' => 'comp_classification_index',
                                                            'offset' => '4',
                                                            'type' => '173'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_comparison_stamp',
                                                            'offset' => '5',
                                                            'type' => '185'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_ver_str_type',
                                                            'offset' => '9',
                                                            'type' => '173'
                                                          },
                                                   '5' => {
                                                            'name' => 'active_comp_ver_str_len',
                                                            'offset' => '16',
                                                            'type' => '173'
                                                          },
                                                   '6' => {
                                                            'name' => 'active_comp_release_date',
                                                            'offset' => '17',
                                                            'type' => '67794'
                                                          },
                                                   '7' => {
                                                            'name' => 'pending_comp_comparison_stamp',
                                                            'offset' => '25',
                                                            'type' => '185'
                                                          },
                                                   '8' => {
                                                            'name' => 'pending_comp_ver_str_type',
                                                            'offset' => '35',
                                                            'type' => '173'
                                                          },
                                                   '9' => {
                                                            'name' => 'pending_comp_ver_str_len',
                                                            'offset' => '36',
                                                            'type' => '173'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_component_parameter_entry',
                                       'Size' => '39',
                                       'Type' => 'Struct'
                                     },
                          '67794' => {
                                       'BaseType' => '173',
                                       'Name' => 'uint8_t[8]',
                                       'Size' => '8',
                                       'Type' => 'Array'
                                     },
                          '6812' => {
                                      'Name' => '_Bool',
                                      'Size' => '1',
                                      'Type' => 'Intrinsic'
                                    },
                          '68654' => {
                                       'BaseType' => '6638',
                                       'Name' => 'struct variable_field const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '68964' => {
                                       'BaseType' => '12716',
                                       'Name' => 'bool8_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '68969' => {
                                       'BaseType' => '65444',
                                       'Name' => 'bitfield64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '69722' => {
                                       'BaseType' => '64498',
                                       'Name' => 'bitfield32_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '7034' => {
                                      'BaseType' => '6638',
                                      'Name' => 'struct variable_field*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '70568' => {
                                       'BaseType' => '64000',
                                       'Name' => 'bitfield16_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '707' => {
                                     'Header' => 'base.h',
                                     'Line' => '88',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'PLDM_RESPONSE',
                                                          'value' => '0'
                                                        },
                                                 '1' => {
                                                          'name' => 'PLDM_REQUEST',
                                                          'value' => '1'
                                                        },
                                                 '2' => {
                                                          'name' => 'PLDM_RESERVED',
                                                          'value' => '2'
                                                        },
                                                 '3' => {
                                                          'name' => 'PLDM_ASYNC_REQUEST_NOTIFY',
                                                          'value' => '3'
                                                        }
                                               },
                                     'Name' => 'enum MessageType',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '719' => {
                                     'Header' => 'base.h',
                                     'Line' => '117',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'command',
                                                          'offset' => '2',
                                                          'type' => '173'
                                                        }
                                               },
                                     'Name' => 'struct pldm_msg_hdr',
                                     'Size' => '3',
                                     'Type' => 'Struct'
                                   },
                          '72115' => {
                                       'BaseType' => '68654',
                                       'Name' => 'struct variable_field const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '73709' => {
                                       'BaseType' => '67612',
                                       'Name' => 'struct pldm_component_parameter_entry*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '73939' => {
                                       'BaseType' => '67508',
                                       'Name' => 'struct pldm_get_firmware_parameters_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '74' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '74240' => {
                                       'BaseType' => '2049',
                                       'Name' => 'uint8_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '74537' => {
                                       'BaseType' => '67326',
                                       'Name' => 'struct pldm_component_image_information*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '75153' => {
                                       'BaseType' => '67131',
                                       'Name' => 'struct pldm_firmware_device_id_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '75457' => {
                                       'BaseType' => '66995',
                                       'Name' => 'struct pldm_package_header_information*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '81' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '82147' => {
                                       'BaseType' => '82164',
                                       'Header' => 'pdr.h',
                                       'Line' => '15',
                                       'Name' => 'pldm_pdr',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '82159' => {
                                       'BaseType' => '82147',
                                       'Name' => 'pldm_pdr const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '82164' => {
                                       'Line' => '18',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_count',
                                                            'offset' => '0',
                                                            'type' => '185'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '4',
                                                            'type' => '185'
                                                          },
                                                   '2' => {
                                                            'name' => 'first',
                                                            'offset' => '8',
                                                            'type' => '83266'
                                                          },
                                                   '3' => {
                                                            'name' => 'last',
                                                            'offset' => '22',
                                                            'type' => '83266'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Source' => 'pdr.c',
                                       'Type' => 'Struct'
                                     },
                          '82224' => {
                                       'BaseType' => '82241',
                                       'Header' => 'pdr.h',
                                       'Line' => '20',
                                       'Name' => 'pldm_pdr_record',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '82236' => {
                                       'BaseType' => '82224',
                                       'Name' => 'pldm_pdr_record const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '82241' => {
                                       'Line' => '9',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '185'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '4',
                                                            'type' => '185'
                                                          },
                                                   '2' => {
                                                            'name' => 'data',
                                                            'offset' => '8',
                                                            'type' => '2049'
                                                          },
                                                   '3' => {
                                                            'name' => 'next',
                                                            'offset' => '22',
                                                            'type' => '83254'
                                                          },
                                                   '4' => {
                                                            'name' => 'is_remote',
                                                            'offset' => '36',
                                                            'type' => '6812'
                                                          },
                                                   '5' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '38',
                                                            'type' => '5485'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_record',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Source' => 'pdr.c',
                                       'Type' => 'Struct'
                                     },
                          '82325' => {
                                       'Header' => 'pdr.h',
                                       'Line' => '274',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '0',
                                                            'type' => '5485'
                                                          },
                                                   '1' => {
                                                            'name' => 'entity_instance_num',
                                                            'offset' => '2',
                                                            'type' => '5485'
                                                          },
                                                   '2' => {
                                                            'name' => 'entity_container_id',
                                                            'offset' => '4',
                                                            'type' => '5485'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity',
                                       'Size' => '6',
                                       'Type' => 'Struct'
                                     },
                          '82382' => {
                                       'BaseType' => '82325',
                                       'Header' => 'pdr.h',
                                       'Line' => '278',
                                       'Name' => 'pldm_entity',
                                       'Size' => '6',
                                       'Type' => 'Typedef'
                                     },
                          '82426' => {
                                       'BaseType' => '82438',
                                       'Header' => 'pdr.h',
                                       'Line' => '288',
                                       'Name' => 'pldm_entity_association_tree',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '82438' => {
                                       'Line' => '433',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'root',
                                                            'offset' => '0',
                                                            'type' => '83271'
                                                          },
                                                   '1' => {
                                                            'name' => 'last_used_container_id',
                                                            'offset' => '8',
                                                            'type' => '5485'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity_association_tree',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Source' => 'pdr.c',
                                       'Type' => 'Struct'
                                     },
                          '82481' => {
                                       'BaseType' => '82498',
                                       'Header' => 'pdr.h',
                                       'Line' => '293',
                                       'Name' => 'pldm_entity_node',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '82498' => {
                                       'Line' => '438',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity',
                                                            'offset' => '0',
                                                            'type' => '82382'
                                                          },
                                                   '1' => {
                                                            'name' => 'parent',
                                                            'offset' => '6',
                                                            'type' => '82382'
                                                          },
                                                   '2' => {
                                                            'name' => 'remote_container_id',
                                                            'offset' => '18',
                                                            'type' => '5485'
                                                          },
                                                   '3' => {
                                                            'name' => 'first_child',
                                                            'offset' => '22',
                                                            'type' => '83271'
                                                          },
                                                   '4' => {
                                                            'name' => 'next_sibling',
                                                            'offset' => '36',
                                                            'type' => '83271'
                                                          },
                                                   '5' => {
                                                            'name' => 'association_type',
                                                            'offset' => '50',
                                                            'type' => '173'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity_node',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Source' => 'pdr.c',
                                       'Type' => 'Struct'
                                     },
                          '830' => {
                                     'BaseType' => '719',
                                     'Name' => 'struct pldm_msg_hdr const',
                                     'Size' => '3',
                                     'Type' => 'Const'
                                   },
                          '83254' => {
                                       'BaseType' => '82241',
                                       'Name' => 'struct pldm_pdr_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '83266' => {
                                       'BaseType' => '82224',
                                       'Name' => 'pldm_pdr_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '83271' => {
                                       'BaseType' => '82481',
                                       'Name' => 'pldm_entity_node*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '835' => {
                                     'Header' => 'base.h',
                                     'Line' => '150',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'hdr',
                                                          'offset' => '0',
                                                          'type' => '719'
                                                        },
                                                 '1' => {
                                                          'name' => 'payload',
                                                          'offset' => '3',
                                                          'type' => '879'
                                                        }
                                               },
                                     'Name' => 'struct pldm_msg',
                                     'Size' => '4',
                                     'Type' => 'Struct'
                                   },
                          '83664' => {
                                       'BaseType' => '83669',
                                       'Name' => 'pldm_entity**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '83669' => {
                                       'BaseType' => '82382',
                                       'Name' => 'pldm_entity*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '83733' => {
                                       'BaseType' => '82426',
                                       'Name' => 'pldm_entity_association_tree*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '84012' => {
                                       'BaseType' => '83271',
                                       'Name' => 'pldm_entity_node**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '84802' => {
                                       'BaseType' => '82159',
                                       'Name' => 'pldm_pdr const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '85056' => {
                                       'BaseType' => '82147',
                                       'Name' => 'pldm_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '874' => {
                                     'BaseType' => '835',
                                     'Name' => 'struct pldm_msg const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '879' => {
                                     'BaseType' => '173',
                                     'Name' => 'uint8_t[1]',
                                     'Size' => '1',
                                     'Type' => 'Array'
                                   },
                          '895' => {
                                     'Header' => 'base.h',
                                     'Line' => '160',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'msg_type',
                                                          'offset' => '0',
                                                          'type' => '707'
                                                        },
                                                 '1' => {
                                                          'name' => 'instance',
                                                          'offset' => '4',
                                                          'type' => '173'
                                                        },
                                                 '2' => {
                                                          'name' => 'pldm_type',
                                                          'offset' => '5',
                                                          'type' => '173'
                                                        },
                                                 '3' => {
                                                          'name' => 'command',
                                                          'offset' => '6',
                                                          'type' => '173'
                                                        },
                                                 '4' => {
                                                          'name' => 'completion_code',
                                                          'offset' => '7',
                                                          'type' => '173'
                                                        }
                                               },
                                     'Name' => 'struct pldm_header_info',
                                     'Size' => '8',
                                     'Type' => 'Struct'
                                   },
                          '9116' => {
                                      'BaseType' => '5485',
                                      'Name' => 'uint16_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '91590' => {
                                       'BaseType' => '82236',
                                       'Name' => 'pldm_pdr_record const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '96470' => {
                                       'BaseType' => '173',
                                       'Header' => 'base.h',
                                       'Line' => '14',
                                       'Name' => 'pldm_tid_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '96482' => {
                                       'BaseType' => '173',
                                       'Header' => 'instance-id.h',
                                       'Line' => '11',
                                       'Name' => 'pldm_instance_id_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '9679' => {
                                      'BaseType' => '123',
                                      'Name' => 'size_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '96862' => {
                                       'Line' => '18',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'prev',
                                                            'offset' => '0',
                                                            'type' => '96482'
                                                          },
                                                   '1' => {
                                                            'name' => 'allocations',
                                                            'offset' => '4',
                                                            'type' => '185'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_tid_state',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Source' => 'instance-id.c',
                                       'Type' => 'Struct'
                                     },
                          '96901' => {
                                       'Line' => '23',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state',
                                                            'offset' => '0',
                                                            'type' => '96943'
                                                          },
                                                   '1' => {
                                                            'name' => 'lock_db_fd',
                                                            'offset' => '8264',
                                                            'type' => '74'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_instance_db',
                                       'PrivateABI' => 1,
                                       'Size' => '2052',
                                       'Source' => 'instance-id.c',
                                       'Type' => 'Struct'
                                     },
                          '96943' => {
                                       'BaseType' => '96862',
                                       'Name' => 'struct pldm_tid_state[256]',
                                       'Size' => '2048',
                                       'Type' => 'Array'
                                     },
                          '974' => {
                                     'BaseType' => '895',
                                     'Name' => 'struct pldm_header_info const',
                                     'Size' => '8',
                                     'Type' => 'Const'
                                   },
                          '97413' => {
                                       'BaseType' => '96901',
                                       'Name' => 'struct pldm_instance_db*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '97838' => {
                                       'BaseType' => '96482',
                                       'Name' => 'pldm_instance_id_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '98014' => {
                                       'BaseType' => '97413',
                                       'Name' => 'struct pldm_instance_db**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '98632' => {
                                       'BaseType' => '173',
                                       'Header' => 'pldm.h',
                                       'Line' => '12',
                                       'Name' => 'mctp_eid_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '98644' => {
                                       'Header' => 'pldm.h',
                                       'Line' => '14',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_REQUESTER_SUCCESS',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_REQUESTER_OPEN_FAIL',
                                                            'value' => '18446744073709551615 (-1)'
                                                          },
                                                   '10' => {
                                                             'name' => 'PLDM_REQUESTER_SETUP_FAIL',
                                                             'value' => '18446744073709551606 (-10)'
                                                           },
                                                   '11' => {
                                                             'name' => 'PLDM_REQUESTER_INVALID_SETUP',
                                                             'value' => '18446744073709551605 (-11)'
                                                           },
                                                   '12' => {
                                                             'name' => 'PLDM_REQUESTER_POLL_FAIL',
                                                             'value' => '18446744073709551604 (-12)'
                                                           },
                                                   '13' => {
                                                             'name' => 'PLDM_REQUESTER_TRANSPORT_BUSY',
                                                             'value' => '18446744073709551603 (-13)'
                                                           },
                                                   '2' => {
                                                            'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
                                                            'value' => '18446744073709551614 (-2)'
                                                          },
                                                   '3' => {
                                                            'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
                                                            'value' => '18446744073709551613 (-3)'
                                                          },
                                                   '4' => {
                                                            'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
                                                            'value' => '18446744073709551612 (-4)'
                                                          },
                                                   '5' => {
                                                            'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
                                                            'value' => '18446744073709551611 (-5)'
                                                          },
                                                   '6' => {
                                                            'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
                                                            'value' => '18446744073709551610 (-6)'
                                                          },
                                                   '7' => {
                                                            'name' => 'PLDM_REQUESTER_SEND_FAIL',
                                                            'value' => '18446744073709551609 (-7)'
                                                          },
                                                   '8' => {
                                                            'name' => 'PLDM_REQUESTER_RECV_FAIL',
                                                            'value' => '18446744073709551608 (-8)'
                                                          },
                                                   '9' => {
                                                            'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
                                                            'value' => '18446744073709551607 (-9)'
                                                          }
                                                 },
                                       'Name' => 'enum pldm_requester_error_codes',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '98747' => {
                                       'BaseType' => '98644',
                                       'Header' => 'pldm.h',
                                       'Line' => '29',
                                       'Name' => 'pldm_requester_rc_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     }
                        },
          'UndefinedSymbols' => {
                                  'libpldm.so.0.4.0' => {
                                                          '_ITM_deregisterTMCloneTable' => 0,
                                                          '_ITM_registerTMCloneTable' => 0,
                                                          '__assert_fail@GLIBC_2.2.5' => 0,
                                                          '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                          '__errno_location@GLIBC_2.2.5' => 0,
                                                          '__gmon_start__' => 0,
                                                          '__stack_chk_fail@GLIBC_2.4' => 0,
                                                          'calloc@GLIBC_2.2.5' => 0,
                                                          'clock_gettime@GLIBC_2.17' => 0,
                                                          'close@GLIBC_2.2.5' => 0,
                                                          'connect@GLIBC_2.2.5' => 0,
                                                          'dup@GLIBC_2.2.5' => 0,
                                                          'fclose@GLIBC_2.2.5' => 0,
                                                          'fcntl64@GLIBC_2.28' => 0,
                                                          'fgets@GLIBC_2.2.5' => 0,
                                                          'fopen64@GLIBC_2.2.5' => 0,
                                                          'free@GLIBC_2.2.5' => 0,
                                                          'getsockopt@GLIBC_2.2.5' => 0,
                                                          'malloc@GLIBC_2.2.5' => 0,
                                                          'memcmp@GLIBC_2.2.5' => 0,
                                                          'memcpy@GLIBC_2.14' => 0,
                                                          'open64@GLIBC_2.2.5' => 0,
                                                          'poll@GLIBC_2.2.5' => 0,
                                                          'recv@GLIBC_2.2.5' => 0,
                                                          'recvmsg@GLIBC_2.2.5' => 0,
                                                          'sendmsg@GLIBC_2.2.5' => 0,
                                                          'sendto@GLIBC_2.2.5' => 0,
                                                          'setsockopt@GLIBC_2.2.5' => 0,
                                                          'socket@GLIBC_2.2.5' => 0,
                                                          'stat64@GLIBC_2.33' => 0,
                                                          'strlen@GLIBC_2.2.5' => 0,
                                                          'strtol@GLIBC_2.2.5' => 0,
                                                          'timerfd_create@GLIBC_2.8' => 0,
                                                          'timerfd_settime@GLIBC_2.8' => 0,
                                                          'write@GLIBC_2.2.5' => 0
                                                        }
                                },
          'WordSize' => '8'
        };
