$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '12.2.0',
          'Headers' => {
                         'base.h' => 1,
                         'bios.h' => 1,
                         'bios_table.h' => 1,
                         'file_io.h' => 1,
                         'firmware_update.h' => 1,
                         'fru.h' => 1,
                         'host.h' => 1,
                         'instance-id.h' => 1,
                         'pdr.h' => 1,
                         'platform.h' => 1,
                         'platform_oem_ibm.h' => 1,
                         'pldm.h' => 1,
                         'utils.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libpldm.so.0.2.0',
          'LibraryVersion' => '0.2.0',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {},
          'SymbolInfo' => {
                            '100232' => {
                                          'Header' => 'pldm.h',
                                          'Return' => '98288',
                                          'ShortName' => 'pldm_open'
                                        },
                            '10033' => {
                                         'Header' => 'bios.h',

                                                 'pldm_entity_association_tree_visit' => 1,
                                                 'pldm_entity_extract' => 1,
                                                 'pldm_entity_get_num_children' => 1,
                                                 'pldm_entity_get_parent' => 1,
                                                 'pldm_entity_is_exist_parent' => 1,
                                                 'pldm_entity_is_node_parent' => 1,
                                                 'pldm_find_entity_ref_in_tree' => 1,
                                                 'pldm_instance_db_destroy' => 1,
                                                 'pldm_instance_db_init' => 1,
                                                 'pldm_instance_db_init_default' => 1,
                                                 'pldm_instance_id_alloc' => 1,
                                                 'pldm_instance_id_free' => 1,
                                                 'pldm_is_current_parent_child' => 1,
                                                 'pldm_is_empty_entity_assoc_tree' => 1,
                                                 'pldm_open' => 1,
                                                 'pldm_pdr_add' => 1,
                                                 'pldm_pdr_add_fru_record_set' => 1,
                                                 'pldm_pdr_destroy' => 1,
                                                 'pldm_pdr_find_record' => 1,
                                                 'pldm_pdr_find_record_by_type' => 1,
                                                 'pldm_pdr_fru_record_set_find_by_rsi' => 1,
                                                 'pldm_pdr_get_next_record' => 1,
                                                 'pldm_pdr_get_record_count' => 1,
                                                 'pldm_pdr_get_record_handle' => 1,
                                                 'pldm_pdr_get_repo_size' => 1,
                                                 'pldm_pdr_init' => 1,
                                                 'pldm_pdr_record_is_remote' => 1,
                                                 'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
                                                 'pldm_pdr_remove_remote_pdrs' => 1,
                                                 'pldm_pdr_update_TL_pdr' => 1,
                                                 'pldm_recv' => 1,
                                                 'pldm_recv_any' => 1,
                                                 'pldm_send' => 1,
                                                 'pldm_send_recv' => 1,
                                                 'unpack_pldm_header' => 1,
                                                 'ver2str' => 1
                                               }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '102' => {
                                     'Name' => 'unsigned long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '109' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '116' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '11614' => {
                                       'BaseType' => '116',
                                       'Name' => 'char*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11631' => {
                                       'BaseType' => '116',
                                       'Name' => 'char const',
                                       'Size' => '1',
                                       'Type' => 'Const'
                                     },
                          '11648' => {
                                       'BaseType' => '123',
                                       'Name' => 'size_t const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '11660' => {
                                       'BaseType' => '46',
                                       'Header' => undef,
                                       'Line' => '37',
                                       'Name' => '__int8_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '11734' => {
                                       'BaseType' => '109',
                                       'Header' => undef,
                                       'Line' => '194',
                                       'Name' => '__ssize_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11746' => {
                                       'BaseType' => '11660',
                                       'Header' => undef,
                                       'Line' => '24',
                                       'Name' => 'int8_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '11811' => {
                                       'BaseType' => '5053',
                                       'Name' => 'uint16_t const',
                                       'Size' => '2',
                                       'Type' => 'Const'
                                     },
                          '11828' => {
                                       'BaseType' => '180',
                                       'Name' => 'uint32_t const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '11999' => {
                                       'BaseType' => '168',
                                       'Header' => 'pldm_types.h',
                                       'Line' => '31',
                                       'Name' => 'bool8_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '12011' => {
                                       'BaseType' => '446',
                                       'Header' => 'pldm_types.h',
                                       'Line' => '163',
                                       'Name' => 'real32_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '123' => {
                                     'BaseType' => '102',
                                     'Header' => undef,
                                     'Line' => '214',
                                     'Name' => 'size_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '12552' => {
                                       'BaseType' => '11631',
                                       'Name' => 'char const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12557' => {
                                       'BaseType' => '11734',
                                       'Header' => undef,
                                       'Line' => '108',
                                       'Name' => 'ssize_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '13093' => {
                                       'Header' => 'platform.h',
                                       'Line' => '237',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_SENSOR_OP_STATE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_STATE_SENSOR_STATE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_NUMERIC_SENSOR_STATE',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum sensor_event_class_states',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '13127' => {
                                       'BaseType' => '13093',
                                       'Name' => 'enum sensor_event_class_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '13350' => {
                                       'Header' => 'platform.h',
                                       'Line' => '454',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '180'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '4',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '5',
                                                            'type' => '168'
                                                          },
                                                   '3' => {
                                                            'name' => 'record_change_num',
                                                            'offset' => '6',
                                                            'type' => '5053'
                                                          },
                                                   '4' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '5053'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_hdr',
                                       'Size' => '10',
                                       'Type' => 'Struct'
                                     },
                          '13429' => {
                                       'Header' => 'platform.h',
                                       'Line' => '526',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '13350'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '16',
                                                            'type' => '5053'
                                                          },
                                                   '2' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '18',
                                                            'type' => '5053'
                                                          },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '20',
                                                            'type' => '5053'
                                                          },
                                                   '4' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '22',
                                                            'type' => '5053'
                                                          },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '24',
                                                            'type' => '5053'
                                                          },
                                                   '6' => {
                                                            'name' => 'sensor_init',
                                                            'offset' => '32',
                                                            'type' => '168'
                                                          },
                                                   '7' => {
                                                            'name' => 'sensor_auxiliary_names_pdr',
                                                            'offset' => '33',
                                                            'type' => '11999'
                                                          },
                                                   '8' => {
                                                            'name' => 'composite_sensor_count',
                                                            'offset' => '34',
                                                            'type' => '168'
                                                          },
                                                   '9' => {
                                                            'name' => 'possible_states',
                                                            'offset' => '35',
                                                            'type' => '874'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_state_sensor_pdr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '13573' => {
                                       'Header' => 'platform.h',
                                       'Line' => '543',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state_set_id',
                                                            'offset' => '0',
                                                            'type' => '5053'
                                                          },
                                                   '1' => {
                                                            'name' => 'possible_states_size',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'states',
                                                            'offset' => '3',
                                                            'type' => '13631'
                                                          }
                                                 },
                                       'Name' => 'struct state_sensor_possible_states',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '13626' => {
                                       'BaseType' => '13573',
                                       'Name' => 'struct state_sensor_possible_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '13647' => {
                                       'Header' => 'platform.h',
                                       'Line' => '553',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '13350'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '16',
                                                            'type' => '5053'
                                                          },
                                                   '10' => {
                                                             'name' => 'possible_states',
                                                             'offset' => '37',
                                                             'type' => '874'
                                                           },
                                                   '2' => {
                                                            'name' => 'effecter_id',
                                                            'offset' => '18',
                                                            'type' => '5053'
                                                          },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '20',
                                                            'type' => '5053'
                                                          },
                                                   '4' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '22',
                                                            'type' => '5053'
                                                          },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '24',
                                                            'type' => '5053'
                                                          },
                                                   '6' => {
                                                            'name' => 'effecter_semantic_id',
                                                            'offset' => '32',
                                                            'type' => '5053'
                                                          },
                                                   '7' => {
                                                            'name' => 'effecter_init',
                                                            'offset' => '34',
                                                            'type' => '168'
                                                          },
                                                   '8' => {
                                                            'name' => 'has_description_pdr',
                                                            'offset' => '35',
                                                            'type' => '11999'
                                                          },
                                                   '9' => {
                                                            'name' => 'composite_effecter_count',
                                                            'offset' => '36',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_state_effecter_pdr',
                                       'Size' => '26',
                                       'Type' => 'Struct'
                                     },
                          '14000' => {
                                       'Header' => 'platform.h',
                                       'Line' => '708',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '180'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '4',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '5',
                                                            'type' => '168'
                                                          },
                                                   '3' => {
                                                            'name' => 'record_change_num',
                                                            'offset' => '6',
                                                            'type' => '5053'
                                                          },
                                                   '4' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '5053'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_value_pdr_hdr',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '14079' => {
                                       'Header' => 'platform.h',
                                       'Line' => '721',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '14000'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '18',
                                                            'type' => '5053'
                                                          },
                                                   '10' => {
                                                             'name' => 'rate_unit',
                                                             'offset' => '38',
                                                             'type' => '168'
                                                           },
                                                   '11' => {
                                                             'name' => 'base_oem_unit_handle',
                                                             'offset' => '39',
                                                             'type' => '168'
                                                           },
                                                   '12' => {
                                                             'name' => 'aux_unit',
                                                             'offset' => '40',
                                                             'type' => '168'
                                                           },
                                                   '13' => {
                                                             'name' => 'aux_unit_modifier',
                                                             'offset' => '41',
                                                             'type' => '11746'
                                                           },
                                                   '14' => {
                                                             'name' => 'aux_rate_unit',
                                                             'offset' => '48',
                                                             'type' => '168'
                                                           },
                                                   '15' => {
                                                             'name' => 'rel',
                                                             'offset' => '49',
                                                             'type' => '168'
                                                           },
                                                   '16' => {
                                                             'name' => 'aux_oem_unit_handle',
                                                             'offset' => '50',
                                                             'type' => '168'
                                                           },
                                                   '17' => {
                                                             'name' => 'is_linear',
                                                             'offset' => '51',
                                                             'type' => '11999'
                                                           },
                                                   '18' => {
                                                             'name' => 'sensor_data_size',
                                                             'offset' => '52',
                                                             'type' => '168'
                                                           },
                                                   '19' => {
                                                             'name' => 'resolution',
                                                             'offset' => '54',
                                                             'type' => '12011'
                                                           },
                                                   '2' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '20',
                                                            'type' => '5053'
                                                          },
                                                   '20' => {
                                                             'name' => 'offset',
                                                             'offset' => '64',
                                                             'type' => '12011'
                                                           },
                                                   '21' => {
                                                             'name' => 'accuracy',
                                                             'offset' => '68',
                                                             'type' => '5053'
                                                           },
                                                   '22' => {
                                                             'name' => 'plus_tolerance',
                                                             'offset' => '70',
                                                             'type' => '168'
                                                           },
                                                   '23' => {
                                                             'name' => 'minus_tolerance',
                                                             'offset' => '71',
                                                             'type' => '168'
                                                           },
                                                   '24' => {
                                                             'name' => 'hysteresis',
                                                             'offset' => '72',
                                                             'type' => '13988'
                                                           },
                                                   '25' => {
                                                             'name' => 'supported_thresholds',
                                                             'offset' => '82',
                                                             'type' => '11987'
                                                           },
                                                   '26' => {
                                                             'name' => 'threshold_and_hysteresis_volatility',
                                                             'offset' => '83',
                                                             'type' => '11987'
                                                           },
                                                   '27' => {
                                                             'name' => 'state_transition_interval',
                                                             'offset' => '86',
                                                             'type' => '12011'
                                                           },
                                                   '28' => {
                                                             'name' => 'update_interval',
                                                             'offset' => '96',
                                                             'type' => '12011'
                                                           },
                                                   '29' => {
                                                             'name' => 'max_readable',
                                                             'offset' => '100',
                                                             'type' => '13988'
                                                           },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '22',
                                                            'type' => '5053'
                                                          },
                                                   '30' => {
                                                             'name' => 'min_readable',
                                                             'offset' => '104',
                                                             'type' => '13988'
                                                           },
                                                   '31' => {
                                                             'name' => 'range_field_format',
                                                             'offset' => '114',
                                                             'type' => '168'
                                                           },
                                                   '32' => {
                                                             'name' => 'range_field_support',
                                                             'offset' => '115',
                                                             'type' => '11987'
                                                           },
                                                   '33' => {
                                                             'name' => 'nominal_value',
                                                             'offset' => '118',
                                                             'type' => '13896'
                                                           },
                                                   '34' => {
                                                             'name' => 'normal_max',
                                                             'offset' => '128',
                                                             'type' => '13896'
                                                           },
                                                   '35' => {
                                                             'name' => 'normal_min',
                                                             'offset' => '132',
                                                             'type' => '13896'
                                                           },
                                                   '36' => {
                                                             'name' => 'warning_high',
                                                             'offset' => '136',
                                                             'type' => '13896'
                                                           },
                                                   '37' => {
                                                             'name' => 'warning_low',
                                                             'offset' => '146',
                                                             'type' => '13896'
                                                           },
                                                   '38' => {
                                                             'name' => 'critical_high',
                                                             'offset' => '150',
                                                             'type' => '13896'
                                                           },
                                                   '39' => {
                                                             'name' => 'critical_low',
                                                             'offset' => '256',
                                                             'type' => '13896'
                                                           },
                                                   '4' => {
                                                            'name' => 'entity_instance_num',
                                                            'offset' => '24',
                                                            'type' => '5053'
                                                          },
                                                   '40' => {
                                                             'name' => 'fatal_high',
                                                             'offset' => '260',
                                                             'type' => '13896'
                                                           },
                                                   '41' => {
                                                             'name' => 'fatal_low',
                                                             'offset' => '264',
                                                             'type' => '13896'
                                                           },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '32',
                                                            'type' => '5053'
                                                          },
                                                   '6' => {
                                                            'name' => 'sensor_init',
                                                            'offset' => '34',
                                                            'type' => '168'
                                                          },
                                                   '7' => {
                                                            'name' => 'sensor_auxiliary_names_pdr',
                                                            'offset' => '35',
                                                            'type' => '11999'
                                                          },
                                                   '8' => {
                                                            'name' => 'base_unit',
                                                            'offset' => '36',
                                                            'type' => '168'
                                                          },
                                                   '9' => {
                                                            'name' => 'unit_modifier',
                                                            'offset' => '37',
                                                            'type' => '11746'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_numeric_sensor_value_pdr',
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '142' => {
                                     'BaseType' => '53',
                                     'Header' => undef,
                                     'Line' => '38',
                                     'Name' => '__uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '1434' => {
                                      'BaseType' => '1439',
                                      'Name' => 'void const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1439' => {
                                      'BaseType' => '1',
                                      'Name' => 'void const',
                                      'Type' => 'Const'
                                    },
                          '14639' => {
                                       'Header' => 'platform.h',
                                       'Line' => '770',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state_set_id',
                                                            'offset' => '0',
                                                            'type' => '5053'
                                                          },
                                                   '1' => {
                                                            'name' => 'possible_states_size',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'states',
                                                            'offset' => '3',
                                                            'type' => '13631'
                                                          }
                                                 },
                                       'Name' => 'struct state_effecter_possible_states',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '14692' => {
                                       'BaseType' => '14639',
                                       'Name' => 'struct state_effecter_possible_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '14697' => {
                                       'Header' => 'platform.h',
                                       'Line' => '818',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'set_request',
                                                            'offset' => '0',
                                                            'type' => '168'
                                                          },
                                                   '1' => {
                                                            'name' => 'effecter_state',
                                                            'offset' => '1',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct state_field_for_state_effecter_set',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '14737' => {
                                       'BaseType' => '14697',
                                       'Header' => 'platform.h',
                                       'Line' => '821',
                                       'Name' => 'set_effecter_state_field',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '14749' => {
                                       'Header' => 'platform.h',
                                       'Line' => '827',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sensor_op_state',
                                                            'offset' => '0',
                                                            'type' => '168'
                                                          },
                                                   '1' => {
                                                            'name' => 'present_state',
                                                            'offset' => '1',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'previous_state',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '3' => {
                                                            'name' => 'event_state',
                                                            'offset' => '3',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct state_field_for_get_state_sensor_readings',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '14815' => {
                                       'BaseType' => '14749',
                                       'Header' => 'platform.h',
                                       'Line' => '835',
                                       'Name' => 'get_sensor_state_field',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '15014' => {
                                       'BaseType' => '168',
                                       'Name' => 'uint8_t[13]',
                                       'Size' => '13',
                                       'Type' => 'Array'
                                     },
                          '154' => {
                                     'BaseType' => '81',
                                     'Header' => undef,
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '15496' => {
                                       'Header' => 'platform.h',
                                       'Line' => '972',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '0',
                                                            'type' => '5053'
                                                          },
                                                   '1' => {
                                                            'name' => 'sensor_event_class_type',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'event_class',
                                                            'offset' => '3',
                                                            'type' => '874'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_sensor_event_data',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '15708' => {
                                       'Header' => 'platform.h',
                                       'Line' => '1053',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'event_data_format',
                                                            'offset' => '0',
                                                            'type' => '168'
                                                          },
                                                   '1' => {
                                                            'name' => 'number_of_change_records',
                                                            'offset' => '1',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'change_records',
                                                            'offset' => '2',
                                                            'type' => '874'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_repository_chg_event_data',
                                       'Size' => '3',
                                       'Type' => 'Struct'
                                     },
                          '1632' => {
                                      'BaseType' => '830',
                                      'Name' => 'struct pldm_msg*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '166' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '168' => {
                                     'BaseType' => '142',
                                     'Header' => undef,
                                     'Line' => '24',
                                     'Name' => 'uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '16933' => {
                                       'BaseType' => '166',
                                       'Name' => 'void**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '180' => {
                                     'BaseType' => '154',
                                     'Header' => undef,
                                     'Line' => '26',
                                     'Name' => 'uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '2077' => {
                                      'BaseType' => '869',
                                      'Name' => 'struct pldm_msg const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2082' => {
                                      'BaseType' => '168',
                                      'Name' => 'uint8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2087' => {
                                      'BaseType' => '180',
                                      'Name' => 'uint32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '21095' => {
                                       'BaseType' => '9084',
                                       'Name' => 'size_t*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '22708' => {
                                       'BaseType' => '22718',
                                       'Name' => 'uint32_t const*const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '22713' => {
                                       'BaseType' => '11828',
                                       'Name' => 'uint32_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '22718' => {
                                       'BaseType' => '22713',
                                       'Name' => 'uint32_t const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '22723' => {
                                       'BaseType' => '15708',
                                       'Name' => 'struct pldm_pdr_repository_chg_event_data*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2903' => {
                                      'BaseType' => '429',
                                      'Name' => 'ver32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '29133' => {
                                       'BaseType' => '14079',
                                       'Name' => 'struct pldm_numeric_sensor_value_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '3344' => {
                                      'BaseType' => '441',
                                      'Name' => 'ver32_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '35700' => {
                                       'BaseType' => '15496',
                                       'Name' => 'struct pldm_sensor_event_data*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '35705' => {
                                       'BaseType' => '35700',
                                       'Name' => 'struct pldm_sensor_event_data*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '363' => {
                                     'Header' => 'pldm_types.h',
                                     'Line' => '24',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'alpha',
                                                          'offset' => '0',
                                                          'type' => '168'
                                                        },
                                                 '1' => {
                                                          'name' => 'update',
                                                          'offset' => '1',
                                                          'type' => '168'
                                                        },
                                                 '2' => {
                                                          'name' => 'minor',
                                                          'offset' => '2',
                                                          'type' => '168'
                                                        },
                                                 '3' => {
                                                          'name' => 'major',
                                                          'offset' => '3',
                                                          'type' => '168'
                                                        }
                                               },
                                     'Name' => 'struct pldm_version',
                                     'Size' => '4',
                                     'Type' => 'Struct'
                                   },
                          '36709' => {
                                       'BaseType' => '14815',
                                       'Name' => 'get_sensor_state_field*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41864' => {
                                       'BaseType' => '14737',
                                       'Name' => 'set_effecter_state_field*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '42691' => {
                                       'BaseType' => '13429',
                                       'Name' => 'struct pldm_state_sensor_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '42696' => {
                                       'BaseType' => '42691',
                                       'Name' => 'struct pldm_state_sensor_pdr*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '42701' => {
                                       'BaseType' => '13626',
                                       'Name' => 'struct state_sensor_possible_states const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '42706' => {
                                       'BaseType' => '42701',
                                       'Name' => 'struct state_sensor_possible_states const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '429' => {
                                     'BaseType' => '363',
                                     'Header' => 'pldm_types.h',
                                     'Line' => '29',
                                     'Name' => 'ver32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '43023' => {
                                       'BaseType' => '13647',
                                       'Name' => 'struct pldm_state_effecter_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '43028' => {
                                       'BaseType' => '43023',
                                       'Name' => 'struct pldm_state_effecter_pdr*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '43033' => {
                                       'BaseType' => '14692',
                                       'Name' => 'struct state_effecter_possible_states const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '43038' => {
                                       'BaseType' => '43033',
                                       'Name' => 'struct state_effecter_possible_states const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '441' => {
                                     'BaseType' => '429',
                                     'Name' => 'ver32_t const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '446' => {
                                     'Name' => 'float',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '46' => {
                                    'Name' => 'signed char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '46553' => {
                                       'BaseType' => '102',
                                       'Header' => undef,
                                       'Line' => '45',
                                       'Name' => '__uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '46630' => {
                                       'BaseType' => '46553',
                                       'Header' => undef,
                                       'Line' => '27',
                                       'Name' => 'uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '46642' => {
                                       'Header' => 'bios.h',
                                       'Line' => '38',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_BIOS_STRING_TABLE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_BIOS_ATTR_TABLE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum pldm_bios_table_types',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '46676' => {
                                       'Header' => 'bios.h',
                                       'Line' => '47',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'string_handle',
                                                            'offset' => '0',
                                                            'type' => '5053'
                                                          },
                                                   '1' => {
                                                            'name' => 'string_length',
                                                            'offset' => '2',
                                                            'type' => '5053'
                                                          },
                                                   '2' => {
                                                            'name' => 'name',
                                                            'offset' => '4',
                                                            'type' => '46733'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_string_table_entry',
                                       'Size' => '5',
                                       'Type' => 'Struct'
                                     },
                          '46728' => {
                                       'BaseType' => '46676',
                                       'Name' => 'struct pldm_bios_string_table_entry const',
                                       'Size' => '5',
                                       'Type' => 'Const'
                                     },
                          '46733' => {
                                       'BaseType' => '116',
                                       'Name' => 'char[1]',
                                       'Size' => '1',
                                       'Type' => 'Array'
                                     },
                          '46749' => {
                                       'Header' => 'bios.h',
                                       'Line' => '53',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_handle',
                                                            'offset' => '0',
                                                            'type' => '5053'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_type',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'string_handle',
                                                            'offset' => '3',
                                                            'type' => '5053'
                                                          },
                                                   '3' => {
                                                            'name' => 'metadata',
                                                            'offset' => '5',
                                                            'type' => '874'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_attr_table_entry',
                                       'Size' => '6',
                                       'Type' => 'Struct'
                                     },
                          '46814' => {
                                       'BaseType' => '46749',
                                       'Name' => 'struct pldm_bios_attr_table_entry const',
                                       'Size' => '6',
                                       'Type' => 'Const'
                                     },
                          '46835' => {
                                       'Header' => 'bios.h',
                                       'Line' => '65',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_handle',
                                                            'offset' => '0',
                                                            'type' => '5053'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_type',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'value',
                                                            'offset' => '3',
                                                            'type' => '874'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_attr_val_table_entry',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '46887' => {
                                       'BaseType' => '46835',
                                       'Name' => 'struct pldm_bios_attr_val_table_entry const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '46956' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '215',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5053'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '6423'
                                                          },
                                                   '2' => {
                                                            'name' => 'pv_num',
                                                            'offset' => '3',
                                                            'type' => '168'
                                                          },
                                                   '3' => {
                                                            'name' => 'pv_handle',
                                                            'offset' => '8',
                                                            'type' => '47059'
                                                          },
                                                   '4' => {
                                                            'name' => 'def_num',
                                                            'offset' => '22',
                                                            'type' => '168'
                                                          },
                                                   '5' => {
                                                            'name' => 'def_index',
                                                            'offset' => '36',
                                                            'type' => '6245'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '47047' => {
                                       'BaseType' => '46956',
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '47059' => {
                                       'BaseType' => '11811',
                                       'Name' => 'uint16_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '47069' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '328',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5053'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '6423'
                                                          },
                                                   '2' => {
                                                            'name' => 'string_type',
                                                            'offset' => '3',
                                                            'type' => '168'
                                                          },
                                                   '3' => {
                                                            'name' => 'min_length',
                                                            'offset' => '4',
                                                            'type' => '5053'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_length',
                                                            'offset' => '6',
                                                            'type' => '5053'
                                                          },
                                                   '5' => {
                                                            'name' => 'def_length',
                                                            'offset' => '8',
                                                            'type' => '5053'
                                                          },
                                                   '6' => {
                                                            'name' => 'def_string',
                                                            'offset' => '22',
                                                            'type' => '12552'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '4707' => {
                                      'BaseType' => '825',
                                      'Name' => 'struct pldm_msg_hdr const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4712' => {
                                      'BaseType' => '890',
                                      'Name' => 'struct pldm_header_info*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '47181' => {
                                       'BaseType' => '47069',
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '47191' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '431',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5053'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '6423'
                                                          },
                                                   '2' => {
                                                            'name' => 'lower_bound',
                                                            'offset' => '8',
                                                            'type' => '46630'
                                                          },
                                                   '3' => {
                                                            'name' => 'upper_bound',
                                                            'offset' => '22',
                                                            'type' => '46630'
                                                          },
                                                   '4' => {
                                                            'name' => 'scalar_increment',
                                                            'offset' => '36',
                                                            'type' => '180'
                                                          },
                                                   '5' => {
                                                            'name' => 'default_value',
                                                            'offset' => '50',
                                                            'type' => '46630'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '47289' => {
                                       'BaseType' => '47191',
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
                                       'Size' => '40',
                                       'Type' => 'Const'
                                     },
                          '47633' => {
                                       'Name' => 'size_t(*)(void const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '1434'
                                                           }
                                                  },
                                       'Return' => '123',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '47701' => {
                                       'Header' => undef,
                                       'Line' => '964',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'table_data',
                                                            'offset' => '0',
                                                            'type' => '6245'
                                                          },
                                                   '1' => {
                                                            'name' => 'table_len',
                                                            'offset' => '8',
                                                            'type' => '123'
                                                          },
                                                   '2' => {
                                                            'name' => 'current_pos',
                                                            'offset' => '22',
                                                            'type' => '123'
                                                          },
                                                   '3' => {
                                                            'name' => 'entry_length_handler',
                                                            'offset' => '36',
                                                            'type' => '47633'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_iter',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '47771' => {
                                       'BaseType' => '47701',
                                       'Name' => 'struct pldm_bios_table_iter const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '4802' => {
                                      'BaseType' => '969',
                                      'Name' => 'struct pldm_header_info const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4807' => {
                                      'BaseType' => '714',
                                      'Name' => 'struct pldm_msg_hdr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '48803' => {
                                       'BaseType' => '47701',
                                       'Name' => 'struct pldm_bios_table_iter*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '48808' => {
                                       'BaseType' => '46887',
                                       'Name' => 'struct pldm_bios_attr_val_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '49223' => {
                                       'BaseType' => '46814',
                                       'Name' => 'struct pldm_bios_attr_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '49829' => {
                                       'BaseType' => '46728',
                                       'Name' => 'struct pldm_bios_string_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '5003' => {
                                      'BaseType' => '67',
                                      'Header' => undef,
                                      'Line' => '40',
                                      'Name' => '__uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '5048' => {
                                      'BaseType' => '168',
                                      'Name' => 'uint8_t const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '5053' => {
                                      'BaseType' => '5003',
                                      'Header' => undef,
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '50950' => {
                                       'BaseType' => '47771',
                                       'Name' => 'struct pldm_bios_table_iter const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '53' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '55734' => {
                                       'BaseType' => '46630',
                                       'Name' => 'uint64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '55938' => {
                                       'BaseType' => '47289',
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '56242' => {
                                       'BaseType' => '12552',
                                       'Name' => 'char const**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '57469' => {
                                       'BaseType' => '47181',
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '59377' => {
                                       'BaseType' => '47047',
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '6206' => {
                                      'Header' => 'utils.h',
                                      'Line' => '18',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ptr',
                                                           'offset' => '0',
                                                           'type' => '6245'
                                                         },
                                                  '1' => {
                                                           'name' => 'length',
                                                           'offset' => '8',
                                                           'type' => '123'
                                                         }
                                                },
                                      'Name' => 'struct variable_field',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '6245' => {
                                      'BaseType' => '5048',
                                      'Name' => 'uint8_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6423' => {
                                      'Name' => '_Bool',
                                      'Size' => '1',
                                      'Type' => 'Intrinsic'
                                    },
                          '65231' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '329',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'uuid',
                                                            'offset' => '0',
                                                            'type' => '65335'
                                                          },
                                                   '1' => {
                                                            'name' => 'package_header_format_version',
                                                            'offset' => '22',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'package_header_size',
                                                            'offset' => '23',
                                                            'type' => '5053'
                                                          },
                                                   '3' => {
                                                            'name' => 'package_release_date_time',
                                                            'offset' => '25',
                                                            'type' => '15014'
                                                          },
                                                   '4' => {
                                                            'name' => 'component_bitmap_bit_length',
                                                            'offset' => '50',
                                                            'type' => '5053'
                                                          },
                                                   '5' => {
                                                            'name' => 'package_version_string_type',
                                                            'offset' => '52',
                                                            'type' => '168'
                                                          },
                                                   '6' => {
                                                            'name' => 'package_version_string_length',
                                                            'offset' => '53',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_header_information',
                                       'Size' => '36',
                                       'Type' => 'Struct'
                                     },
                          '65335' => {
                                       'BaseType' => '168',
                                       'Name' => 'uint8_t[16]',
                                       'Size' => '16',
                                       'Type' => 'Array'
                                     },
                          '65367' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '343',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_length',
                                                            'offset' => '0',
                                                            'type' => '5053'
                                                          },
                                                   '1' => {
                                                            'name' => 'descriptor_count',
                                                            'offset' => '2',
                                                            'type' => '168'
                                                          },
                                                   '2' => {
                                                            'name' => 'device_update_option_flags',
                                                            'offset' => '3',
                                                            'type' => '62734'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_image_set_version_string_type',
                                                            'offset' => '7',
                                                            'type' => '168'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_image_set_version_string_length',
                                                            'offset' => '8',
                                                            'type' => '168'
                                                          },
                                                   '5' => {
                                                            'name' => 'fw_device_pkg_data_length',
                                                            'offset' => '9',
                                                            'type' => '5053'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_firmware_device_id_record',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '65562' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '377',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '5053'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '5053'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_comparison_stamp',
                                                            'offset' => '4',
                                                            'type' => '180'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_options',
                                                            'offset' => '8',
                                                            'type' => '62236'
                                                          },
                                                   '4' => {
                                                            'name' => 'requested_comp_activation_method',
                                                            'offset' => '16',
                                                            'type' => '62236'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_location_offset',
                                                            'offset' => '18',
                                                            'type' => '180'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_size',
                                                            'offset' => '22',
                                                            'type' => '180'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_version_string_type',
                                                            'offset' => '32',
                                                            'type' => '168'
                                                          },
                                                   '8' => {
                                                            'name' => 'comp_version_string_length',
                                                            'offset' => '33',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_component_image_information',
                                       'Size' => '22',
                                       'Type' => 'Struct'
                                     },
                          '65744' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '403',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '168'
                                                          },
                                                   '1' => {
                                                            'name' => 'capabilities_during_update',
                                                            'offset' => '1',
                                                            'type' => '62734'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_count',
                                                            'offset' => '5',
                                                            'type' => '5053'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_image_set_ver_str_type',
                                                            'offset' => '7',
                                                            'type' => '168'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_image_set_ver_str_len',
                                                            'offset' => '8',
                                                            'type' => '168'
                                                          },
                                                   '5' => {
                                                            'name' => 'pending_comp_image_set_ver_str_type',
                                                            'offset' => '9',
                                                            'type' => '168'
                                                          },
                                                   '6' => {
                                                            'name' => 'pending_comp_image_set_ver_str_len',
                                                            'offset' => '16',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_get_firmware_parameters_resp',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '65848' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '417',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '5053'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '5053'
                                                          },
                                                   '10' => {
                                                             'name' => 'pending_comp_release_date',
                                                             'offset' => '37',
                                                             'type' => '66030'
                                                           },
                                                   '11' => {
                                                             'name' => 'comp_activation_methods',
                                                             'offset' => '51',
                                                             'type' => '62236'
                                                           },
                                                   '12' => {
                                                             'name' => 'capabilities_during_update',
                                                             'offset' => '53',
                                                             'type' => '62734'
                                                           },
                                                   '2' => {
                                                            'name' => 'comp_classification_index',
                                                            'offset' => '4',
                                                            'type' => '168'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_comparison_stamp',
                                                            'offset' => '5',
                                                            'type' => '180'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_ver_str_type',
                                                            'offset' => '9',
                                                            'type' => '168'
                                                          },
                                                   '5' => {
                                                            'name' => 'active_comp_ver_str_len',
                                                            'offset' => '16',
                                                            'type' => '168'
                                                          },
                                                   '6' => {
                                                            'name' => 'active_comp_release_date',
                                                            'offset' => '17',
                                                            'type' => '66030'
                                                          },
                                                   '7' => {
                                                            'name' => 'pending_comp_comparison_stamp',
                                                            'offset' => '25',
                                                            'type' => '180'
                                                          },
                                                   '8' => {
                                                            'name' => 'pending_comp_ver_str_type',
                                                            'offset' => '35',
                                                            'type' => '168'
                                                          },
                                                   '9' => {
                                                            'name' => 'pending_comp_ver_str_len',
                                                            'offset' => '36',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_component_parameter_entry',
                                       'Size' => '39',
                                       'Type' => 'Struct'
                                     },
                          '66030' => {
                                       'BaseType' => '168',
                                       'Name' => 'uint8_t[8]',
                                       'Size' => '8',
                                       'Type' => 'Array'
                                     },
                          '6645' => {
                                      'BaseType' => '6206',
                                      'Name' => 'struct variable_field*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '66890' => {
                                       'BaseType' => '6206',
                                       'Name' => 'struct variable_field const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '67' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '67238' => {
                                       'BaseType' => '11999',
                                       'Name' => 'bool8_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '70318' => {
                                       'BaseType' => '66890',
                                       'Name' => 'struct variable_field const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '714' => {
                                     'Header' => 'base.h',
                                     'Line' => '117',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'command',
                                                          'offset' => '2',
                                                          'type' => '168'
                                                        }
                                               },
                                     'Name' => 'struct pldm_msg_hdr',
                                     'Size' => '3',
                                     'Type' => 'Struct'
                                   },
                          '71620' => {
                                       'BaseType' => '65848',
                                       'Name' => 'struct pldm_component_parameter_entry*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '71850' => {
                                       'BaseType' => '65744',
                                       'Name' => 'struct pldm_get_firmware_parameters_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '72151' => {
                                       'BaseType' => '2082',
                                       'Name' => 'uint8_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '72448' => {
                                       'BaseType' => '65562',
                                       'Name' => 'struct pldm_component_image_information*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '73064' => {
                                       'BaseType' => '65367',
                                       'Name' => 'struct pldm_firmware_device_id_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '73216' => {
                                       'BaseType' => '65231',
                                       'Name' => 'struct pldm_package_header_information*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '74' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '79674' => {
                                       'BaseType' => '79691',
                                       'Header' => undef,
                                       'Line' => '15',
                                       'Name' => 'pldm_pdr',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '79686' => {
                                       'BaseType' => '79674',
                                       'Name' => 'pldm_pdr const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '79691' => {
                                       'Header' => undef,
                                       'Line' => '18',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_count',
                                                            'offset' => '0',
                                                            'type' => '180'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '4',
                                                            'type' => '180'
                                                          },
                                                   '2' => {
                                                            'name' => 'first',
                                                            'offset' => '8',
                                                            'type' => '80744'
                                                          },
                                                   '3' => {
                                                            'name' => 'last',
                                                            'offset' => '22',
                                                            'type' => '80744'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '79756' => {
                                       'BaseType' => '79773',
                                       'Header' => undef,
                                       'Line' => '20',
                                       'Name' => 'pldm_pdr_record',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '79768' => {
                                       'BaseType' => '79756',
                                       'Name' => 'pldm_pdr_record const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '79773' => {
                                       'Header' => undef,
                                       'Line' => '9',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '180'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '4',
                                                            'type' => '180'
                                                          },
                                                   '2' => {
                                                            'name' => 'data',
                                                            'offset' => '8',
                                                            'type' => '2082'
                                                          },
                                                   '3' => {
                                                            'name' => 'next',
                                                            'offset' => '22',
                                                            'type' => '80732'
                                                          },
                                                   '4' => {
                                                            'name' => 'is_remote',
                                                            'offset' => '36',
                                                            'type' => '6423'
                                                          },
                                                   '5' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '38',
                                                            'type' => '5053'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_record',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '79864' => {
                                       'Header' => 'pdr.h',
                                       'Line' => '217',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '0',
                                                            'type' => '5053'
                                                          },
                                                   '1' => {
                                                            'name' => 'entity_instance_num',
                                                            'offset' => '2',
                                                            'type' => '5053'
                                                          },
                                                   '2' => {
                                                            'name' => 'entity_container_id',
                                                            'offset' => '4',
                                                            'type' => '5053'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity',
                                       'Size' => '6',
                                       'Type' => 'Struct'
                                     },
                          '79916' => {
                                       'BaseType' => '79864',
                                       'Header' => 'pdr.h',
                                       'Line' => '221',
                                       'Name' => 'pldm_entity',
                                       'Size' => '6',
                                       'Type' => 'Typedef'
                                     },
                          '79956' => {
                                       'BaseType' => '79968',
                                       'Header' => undef,
                                       'Line' => '231',
                                       'Name' => 'pldm_entity_association_tree',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '79968' => {
                                       'Header' => undef,
                                       'Line' => '368',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'root',
                                                            'offset' => '0',
                                                            'type' => '80749'
                                                          },
                                                   '1' => {
                                                            'name' => 'last_used_container_id',
                                                            'offset' => '8',
                                                            'type' => '5053'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity_association_tree',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '80011' => {
                                       'BaseType' => '80023',
                                       'Header' => undef,
                                       'Line' => '236',
                                       'Name' => 'pldm_entity_node',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '80023' => {
                                       'Header' => undef,
                                       'Line' => '373',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity',
                                                            'offset' => '0',
                                                            'type' => '79916'
                                                          },
                                                   '1' => {
                                                            'name' => 'parent',
                                                            'offset' => '6',
                                                            'type' => '79916'
                                                          },
                                                   '2' => {
                                                            'name' => 'first_child',
                                                            'offset' => '22',
                                                            'type' => '80749'
                                                          },
                                                   '3' => {
                                                            'name' => 'next_sibling',
                                                            'offset' => '36',
                                                            'type' => '80749'
                                                          },
                                                   '4' => {
                                                            'name' => 'association_type',
                                                            'offset' => '50',
                                                            'type' => '168'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity_node',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '80732' => {
                                       'BaseType' => '79773',
                                       'Name' => 'struct pldm_pdr_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80744' => {
                                       'BaseType' => '79756',
                                       'Name' => 'pldm_pdr_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80749' => {
                                       'BaseType' => '80011',
                                       'Name' => 'pldm_entity_node*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '81' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '81511' => {
                                       'BaseType' => '81516',
                                       'Name' => 'pldm_entity**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '81516' => {
                                       'BaseType' => '79916',
                                       'Name' => 'pldm_entity*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '81601' => {
                                       'BaseType' => '79956',
                                       'Name' => 'pldm_entity_association_tree*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '81980' => {
                                       'BaseType' => '80749',
                                       'Name' => 'pldm_entity_node**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '825' => {
                                     'BaseType' => '714',
                                     'Name' => 'struct pldm_msg_hdr const',
                                     'Size' => '3',
                                     'Type' => 'Const'
                                   },
                          '82697' => {
                                       'BaseType' => '79674',
                                       'Name' => 'pldm_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '830' => {
                                     'Header' => 'base.h',
                                     'Line' => '150',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'hdr',
                                                          'offset' => '0',
                                                          'type' => '714'
                                                        },
                                                 '1' => {
                                                          'name' => 'payload',
                                                          'offset' => '3',
                                                          'type' => '874'
                                                        }
                                               },
                                     'Name' => 'struct pldm_msg',
                                     'Size' => '4',
                                     'Type' => 'Struct'
                                   },
                          '8521' => {
                                      'BaseType' => '5053',
                                      'Name' => 'uint16_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '869' => {
                                     'BaseType' => '830',
                                     'Name' => 'struct pldm_msg const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '874' => {
                                     'BaseType' => '168',
                                     'Name' => 'uint8_t[1]',
                                     'Size' => '1',
                                     'Type' => 'Array'
                                   },
                          '890' => {
                                     'Header' => 'base.h',
                                     'Line' => '160',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'msg_type',
                                                          'offset' => '0',
                                                          'type' => '702'
                                                        },
                                                 '1' => {
                                                          'name' => 'instance',
                                                          'offset' => '4',
                                                          'type' => '168'
                                                        },
                                                 '2' => {
                                                          'name' => 'pldm_type',
                                                          'offset' => '5',
                                                          'type' => '168'
                                                        },
                                                 '3' => {
                                                          'name' => 'command',
                                                          'offset' => '6',
                                                          'type' => '168'
                                                        },
                                                 '4' => {
                                                          'name' => 'completion_code',
                                                          'offset' => '7',
                                                          'type' => '168'
                                                        }
                                               },
                                     'Name' => 'struct pldm_header_info',
                                     'Size' => '8',
                                     'Type' => 'Struct'
                                   },
                          '89105' => {
                                       'BaseType' => '79686',
                                       'Name' => 'pldm_pdr const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '89110' => {
                                       'BaseType' => '79768',
                                       'Name' => 'pldm_pdr_record const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '9084' => {
                                      'BaseType' => '123',
                                      'Name' => 'size_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '96164' => {
                                       'BaseType' => '168',
                                       'Header' => 'base.h',
                                       'Line' => '14',
                                       'Name' => 'pldm_tid_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '96176' => {
                                       'BaseType' => '168',
                                       'Header' => 'instance-id.h',
                                       'Line' => '11',
                                       'Name' => 'pldm_instance_id_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '96556' => {
                                       'Header' => undef,
                                       'Line' => '19',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'prev',
                                                            'offset' => '0',
                                                            'type' => '96176'
                                                          },
                                                   '1' => {
                                                            'name' => 'allocations',
                                                            'offset' => '4',
                                                            'type' => '180'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_tid_state',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '96595' => {
                                       'Header' => undef,
                                       'Line' => '24',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state',
                                                            'offset' => '0',
                                                            'type' => '96637'
                                                          },
                                                   '1' => {
                                                            'name' => 'lock_db_fd',
                                                            'offset' => '8264',
                                                            'type' => '74'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_instance_db',
                                       'PrivateABI' => 1,
                                       'Size' => '2052',
                                       'Type' => 'Struct'
                                     },
                          '96637' => {
                                       'BaseType' => '96556',
                                       'Name' => 'struct pldm_tid_state[256]',
                                       'Size' => '2048',
                                       'Type' => 'Array'
                                     },
                          '969' => {
                                     'BaseType' => '890',
                                     'Name' => 'struct pldm_header_info const',
                                     'Size' => '8',
                                     'Type' => 'Const'
                                   },
                          '97065' => {
                                       'BaseType' => '96595',
                                       'Name' => 'struct pldm_instance_db*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '97491' => {
                                       'BaseType' => '96176',
                                       'Name' => 'pldm_instance_id_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '97667' => {
                                       'BaseType' => '97065',
                                       'Name' => 'struct pldm_instance_db**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '98179' => {
                                       'BaseType' => '168',
                                       'Header' => 'pldm.h',
                                       'Line' => '12',
                                       'Name' => 'mctp_eid_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '98191' => {
                                       'Header' => 'pldm.h',
                                       'Line' => '14',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_REQUESTER_SUCCESS',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_REQUESTER_OPEN_FAIL',
                                                            'value' => '18446744073709551615 (-1)'
                                                          },
                                                   '10' => {
                                                             'name' => 'PLDM_REQUESTER_SETUP_FAIL',
                                                             'value' => '18446744073709551606 (-10)'
                                                           },
                                                   '11' => {
                                                             'name' => 'PLDM_REQUESTER_INVALID_SETUP',
                                                             'value' => '18446744073709551605 (-11)'
                                                           },
                                                   '12' => {
                                                             'name' => 'PLDM_REQUESTER_POLL_FAIL',
                                                             'value' => '18446744073709551604 (-12)'
                                                           },
                                                   '2' => {
                                                            'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
                                                            'value' => '18446744073709551614 (-2)'
                                                          },
                                                   '3' => {
                                                            'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
                                                            'value' => '18446744073709551613 (-3)'
                                                          },
                                                   '4' => {
                                                            'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
                                                            'value' => '18446744073709551612 (-4)'
                                                          },
                                                   '5' => {
                                                            'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
                                                            'value' => '18446744073709551611 (-5)'
                                                          },
                                                   '6' => {
                                                            'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
                                                            'value' => '18446744073709551610 (-6)'
                                                          },
                                                   '7' => {
                                                            'name' => 'PLDM_REQUESTER_SEND_FAIL',
                                                            'value' => '18446744073709551609 (-7)'
                                                          },
                                                   '8' => {
                                                            'name' => 'PLDM_REQUESTER_RECV_FAIL',
                                                            'value' => '18446744073709551608 (-8)'
                                                          },
                                                   '9' => {
                                                            'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
                                                            'value' => '18446744073709551607 (-9)'
                                                          }
                                                 },
                                       'Name' => 'enum pldm_requester_error_codes',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '98288' => {
                                       'BaseType' => '98191',
                                       'Header' => 'pldm.h',
                                       'Line' => '28',
                                       'Name' => 'pldm_requester_rc_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     }
                        },
          'UndefinedSymbols' => {
                                  'libpldm.so.0.2.0' => {
                                                          '_ITM_deregisterTMCloneTable' => 0,
                                                          '_ITM_registerTMCloneTable' => 0,
                                                          '__assert_fail@GLIBC_2.2.5' => 0,
                                                          '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                          '__errno_location@GLIBC_2.2.5' => 0,
                                                          '__gmon_start__' => 0,
                                                          '__stack_chk_fail@GLIBC_2.4' => 0,
                                                          'calloc@GLIBC_2.2.5' => 0,
                                                          'clock_gettime@GLIBC_2.17' => 0,
                                                          'close@GLIBC_2.2.5' => 0,
                                                          'connect@GLIBC_2.2.5' => 0,
                                                          'dup@GLIBC_2.2.5' => 0,
                                                          'fcntl64@GLIBC_2.28' => 0,
                                                          'free@GLIBC_2.2.5' => 0,
                                                          'malloc@GLIBC_2.2.5' => 0,
                                                          'memcmp@GLIBC_2.2.5' => 0,
                                                          'memcpy@GLIBC_2.14' => 0,
                                                          'open64@GLIBC_2.2.5' => 0,
                                                          'poll@GLIBC_2.2.5' => 0,
                                                          'recv@GLIBC_2.2.5' => 0,
                                                          'recvmsg@GLIBC_2.2.5' => 0,
                                                          'sendmsg@GLIBC_2.2.5' => 0,
                                                          'sendto@GLIBC_2.2.5' => 0,
                                                          'socket@GLIBC_2.2.5' => 0,
                                                          'stat64@GLIBC_2.33' => 0,
                                                          'strlen@GLIBC_2.2.5' => 0,
                                                          'write@GLIBC_2.2.5' => 0
                                                        }
                                },
          'WordSize' => '8'
        };
